[
  {
    "firstsign": "aries",
    "secondsign": "aries",
    "text": "Explosive! Aries and Aries are two fire sign superstars who collide on one stage—a rare occurrence that will either be electrifying or combustible. You’re attracted to each others’ ambitious, larger than life personalities, but wait…there’s more! Aries is an extremely loyal sign and you don’t trust easily. Finding someone who shares your qualities of devotion AND your paranoia can be a dream come true. You both like to be coddled and yes, babied. This is all well and good if you’re able to switch off playing Mama or Dada. Kids may seem like an unnecessary addition, but sharing parental duties can be an enlivening experience for the two of you, who wind up rediscovering your youthful energy through your brood. If both of you have a temper tantrum at the same time, look out! Plates go smashing, Jimmy Choos a-stompin’ and it ain’t a pretty sight. While you’re both big earners, you blaze through cash just as quickly. Hire a financial advisor to be the “third” in your relationship. There’s a tendency to get lost in each other here as well. Don’t become so obsessed with each other that you forget to call up your friends and family! Your Sun signs are both in the element of fire. This exothermic combination can move from zero to soulmate in mere seconds, as you recognize a kindred spirit in this compatible astrology love match. But as quickly as your lusty wildfire blazes up, it can also sweep out of control…or go from sizzle to fizzle. Your tempers can be as scorching as your sex, so while you might set off an inferno in the sheets, your arguments can also be legendary.\n\nRemember: Civilization began when man learned to make, tend and control fire. It cooks our meals, keeps us warm, powers everything. But by nature, fire does not WANT to be controlled, and neither do fire signs. This relationship must leave room for individuality, exploration and autonomy within safe boundaries. Making and keeping a commitment has to be handled delicately, so as not to lose the spark or smother the flame."
  },
  {
    "firstsign": "taurus",
    "secondsign": "aries",
    "text": "When Aries and Taurus come together for love or any kind of relationship, it’s dynamic but also grounding. Aries loves to be first, while Taurus takes their sweet time. Let Taurus be the rock that holds down the fort, and Aries be the roll that keeps the two of you from getting stuck in a rut. Everlasting love is a possibility here, if you can pace your way to the altar. The Aries-Taurus combo begins with a bang: gushing compliments, long-stemmed roses, electrifying conversations over a choice bottle of Cabernet. During the courtship phase, Taurus is happy to bask in Aries’ fiery glow. With the Bull’s rapt attention, Aries puts on a show-stopping performance that rivals Celine Dion in Vegas. Viva la difference! Homebody Taurus wants to settle down and create family traditions. Aries wants to roam around on an eternal discovery voyage. You move at such different paces it’s amazing you met in the first place. To make this relationship work, embrace your different speeds. Let Taurus be the rock that holds down the fort, and Aries be the roll that keeps the two of you from getting stuck in a rut. Creating a family together can be fun provided Aries doesn’t dump all the domestic duties onto people-pleasing Taurus. Expect to play very different roles with one another. Aries will push for growth and progress, dreaming up exciting travels, businesses, and adventures for the two of you to explore. Taurus will bring the practical magic, ensuring that budgets are adhered to, timelines considered, and the resources all in place for a safe and successful lift-off. Handle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing.\n\n"
  },
  {
    "firstsign": "gemini",
    "secondsign": "aries",
    "text": "When Aries and Gemini come together for love or any kind of relationship, it’s exciting and dynamic! These two intellectuals both love good conversation, which can make for a true meeting of the minds. An Aries-Gemini relationship is never dull, since you both crave adventure. Easy breezy! Aries and Gemini make for a harmonious match-up. A meeting of two beautiful minds, this relationship promises to be an intellectually stimulating one. Conversation is the aphrodisiac here, but so is a common love for adventure and excitement. You both move at warp speed, and will delight in having found someone who can actually keep up with you. While passion is never in short order, you’ll have to work hard to develop an emotional bond. Gemini makes fast friends with everyone from the barista to the busboy, while Aries prefers to socialize with a select few. As the star sign of the Twins, Gemini can easily activate jealousy by failing to devote undivided attention to the Ram. One of you will need to keep the home fires burning here, but who? Alternatively, you could tour the country in an Airstream trailer to satisfy your mutual quest for more and more new experiences. Let the good times roll! As fire and air signs, Aries and Gemini have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond. In some cases, it may cool down to more of a buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways."
  },
  {
    "firstsign": "cancer",
    "secondsign": "aries",
    "text": "When Aries and Cancer come together for love or any kind of relationship, it’s nurturing but also overbearing at times! These two moody star signs are great at keeping it real. An Aries-Cancer relationship is challenging but loving, since you both understand each others’ need to be taken care of. Nurturing and loving. Cancer is the zodiac’s mother sign; Aries is the baby. This can be a relationship of endless care-taking or of tireless demands. There’s a moody quality to both of you that can be enhanced when you’re together—but neither of you considers this a bad thing. You’re able to “keep it real” around one another; no false fronts or exhausting facades. What a relief! Your shared competitive spirit makes you great motivators and cheerleaders for one another. There are challenges here, but the kind that you can grow from. No resting on your laurels: If you can provide each other with enough emotional security (more of a challenge for Aries than Cancer), you make great partners and parents to children, extended family, and pets. Cancer is a legendary homebody, but Aries can lounge like the best of them. Having a comfortable base camp is essential for your relationship. Since you both need your space, try creating separate offices or designated rooms to retreat to when you need your individual “me time.” Too close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation."
  },
  {
    "firstsign": "leo",
    "secondsign": "aries",
    "text": "When Aries and Leo come together for love or any kind of relationship, it’s fiery and star-powered! These two attention-seeking signs love the spotlight, which can make it difficult if you’re competing for the same role. An Aries-Leo relationship is never dull, since you both understand each others’ need for praise and recognition. Roll out the red carpet; tip off the paparazzi: Aries and Leo are a star-powered match! There’s a celeb quality to your combo that makes you electrifying to behold as a couple. While you’re both a little self-centered and bossy at times, you’ve finally found someone who can keep up with your tireless energy! You both crave public attention and praise. As long as you’re not competing for the same role, this is a warm and energizing match-up. Issues can flare up when kids come into the picture. Eternally youthful Leo gets down in the sandbox to play, forgetting that Aries needs to be babied too. Aries’ brash parenting style can offend softhearted Leo who thinks finger painting counts as fine art. Aries will have to quell your inner taskmaster if you want to stay in the VIP lounge of the Lion’s den. Still, you both sort of enjoy bossing each other around…and the advice you give one another is straight from the heart. You’ll both grow stronger, richer, faster, and more motivated as a result of your match-up. The heat is on! Your Sun signs are both in the element of fire. This exothermic combination can move from zero to soulmate in mere seconds, as you recognize a kindred spirit in this compatible astrology love match. But as quickly as your lusty wildfire blazes up, it can also sweep out of control…or go from sizzle to fizzle. Your tempers can be as scorching as your sex, so while you might set off an inferno in the sheets, your arguments can also be legendary."
  },
  {
    "firstsign": "virgo",
    "secondsign": "aries",
    "text": "When Aries and Virgo come together for love or any kind of relationship, it’s challenging but also healing! These two signs can easily butt heads, but uniting around a common mission can strengthen your bond. An Aries-Virgo relationship can lead to frustration, since you both could find yourselves stepping on each others’ toes.\nNot exactly the best idea, but…it happens. Oddly enough, dancing tends to be an activity that you share a love for. So get suited up and head to the studio! You might actually work out a compromise with the help of a ballroom or salsa instructor. If you can get into step with each other and figure out who’s leading when, this relationship is an exciting challenge that will keep you both on your toes. You’re both notably neurotic, and your banter about all the things that are wrong with the planet might just lead you to a shared purpose. Uniting around a common charitable cause can make you a force to be reckoned with. Virgo plans the charity fundraiser, Aries gets the press to show up and cover the event. Voila! Awareness grows and the two of you feel as if you’ve done something remarkably significant. That said, you might hate each other before the project is through. Aries has a penchant for starting tasks and leaving them unfinished. Virgo autopilots into martyr role and picks up the slack for Aries, seething silently with resentment. Aries’ spending knows no bounds while Virgo is a notorious penny pincher. When you apply your vastly different styles to building a home or family together it’s often trouble in paradise. Handle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing."
  },
  {
    "firstsign": "libra",
    "secondsign": "aries",
    "text": "When Aries and Libra come together for love or any kind of relationship, it’s passionate but also feisty! These two dreamers are passionate about what they believe in, which can lead to spontaneous combustion if they find themselves at odds. An Aries-Libra relationship is challenging, but you can meet each other halfway by coming together around a shared mission. A match made in heaven? When warrior Aries meets peaceful Libra, the chemistry is immediate—even if you initially can’t stand each other. That tension usually dissolves as you discover a shared conviction for justice and honor. What do you believe in? What do you stand for? Dive into those deep and heady conversations as quickly as you can. Although you have different fighting styles, if you are passionate about the same issues this can be an idealistic match. Socially, Libra likes to work the room, while Aries prefers undivided attention from a few admiring fans. Meet each other in the middle, and this relationship will make you both better people. It’s a love-hate relationship here. Fast-paced Aries acts on impulse, which can ruffle languid Libra’s feathers. Libra is polished, charming and non-confrontational, while tactless Aries goes right for the jugular. While you may talk about family, neither sign may be home long enough to actually schedule procreating. If ambitious Aries wants to parent, you’ll need to set up a home-based business. Social Libra will need to get your fix from hosting guests and planning the elaborate parties you both love. Let the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways."
  },
  {
    "firstsign": "scorpio",
    "secondsign": "aries",
    "text": "When Aries and Scorpio come together for love or any kind of relationship, it’s smokin’ hot! These two feisty signs both love a good argument, which can lead to explosive fights, but also epic makeup sex. An Aries-Scorpio relationship is as much exciting as it is clandestine, since you both understand each others’ need for privacy. Spy games, anyone? Aries and Scorpio is a tricky combination with undeniable sexual chemistry. Two dynamic beings, you’re both competitive, slow to trust, and incredibly private. So…who’s gonna show your hand first? You could do it the slow way (Google-stalk each other, ply mutual friends for information, drop cryptic hints) or just make it easy on yourselves and admit that you wanted to rip each others’ clothes off the minute you met. Both Aries and Scorpio have passionate Mars as a ruling planet, which makes this match-up red-hot. Though your bedroom antics are the ties that bind, make sure the attraction goes deeper than sexual chemistry before you start labeling it “a relationship.” Fights can be epic between Aries and Scorpio, as both signs view compromise as a sign of weakness. If you can both put your pride aside and learn when to surrender, you’ll elevate each other to new creative and sensual highs for years to come. Too close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation. So, how can the traditionalist water sign and the risk-taking fire sign happily coexist?"
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "aries",
    "text": "When Aries and Sagittarius come together for love or any kind of relationship, it’s fiery and liberating! These two free spirits love excitement and adventure, which can make it difficult to settle down. An Aries-Sagittarius relationship is never dull, since you both understand each others’ need for independence and freedom. Kindred spirits to the core, Aries and Sagittarius are a match made in fire sign heaven. You both cherish your independence and get nauseous at the idea of “settling down” or “growing old together.” Fortunately, you’ve found someone who’d rather retire on a rocket ship than in a rocking chair. As you elevate each other to new creative heights you may accidentally find yourselves in a relationship…which works better for low-maintenance Sagittarius than it does for fanfare-loving Aries. Once you’ve sealed the deal, it’s easy to let romance fade into the background. Who needs it when you’re having so much fun roaming the world together? You do. Make time to hold hands and gaze in each others’ eyes every now and again. Surprise each other with presents, flowers, massages, and spontaneous getaways. Otherwise, the sizzle that brought you together could fizzle into a platonic friendship. Children may not be part of the grand plan for you two free spirits, but you’ll need to co-create something to make the most out of your combined talents, like a business venture, charity, or insanely elaborate work of art. The heat is on! Your Sun signs are both in the element of fire. This exothermic combination can move from zero to soulmate in mere seconds, as you recognize a kindred spirit in this compatible astrology love match. But as quickly as your lusty wildfire blazes up, it can also sweep out of control…or go from sizzle to fizzle. Your tempers can be as scorching as your sex, so while you might set off an inferno in the sheets, your arguments can also be legendary."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "aries",
    "text": "When Aries and Capricorn come together for love or any kind of relationship, it’s complementary but also demanding. These larger-than-life personas both strive for success and achievement, which can become draining. An Aries-Capricorn relationship is destined for power couple status, but only if you can compromise in your collaborations. Warm, fuzzy…and a little bit draining. Capricorn is responsible, protective, and loyal—a safe harbor for Aries, who craves structure and certainty from a partner. Electrifying, impulsive Aries lights Capricorn’s fire, bringing out the repressed wild side of the buttoned-up Goat. As the zodiac’s “father sign,” Capricorn often plays a dutiful role in the relationship. Collaborating on a business venture can be both fulfilling and romantic, as your innate talents dovetail beautifully. With your larger-than-life public personas, you make an attractive and enviable power couple that people love to watch. Aries is the zodiac’s baby, and can revert to spoiled brat mode under Capricorn’s endless generosity. Aries will need to step up a bit in this relationship, otherwise Capricorn can get burned out and resentful. Capricorn will need to regulate Aries demands and say no from time to time. Handle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing.\nA battle can erupt as one of you strives for freedom while the other craves consistency."
  },
  {
    "firstsign": "aquarius",
    "secondsign": "aries",
    "text": "When Aries and Aquarius come together for love or any kind of relationship, it’s a playful best friends with benefits dynamic. These two opinionated signs both love to debate, which can easily lead to an explosion. An Aries-Aquarius relationship is complementary and exciting, since you both understand each others’ need for worldly adventures. BFFs with benefits! This energetic match-up is full of playful humor and offbeat adventures. You’d still be friends if the sexual chemistry wasn’t there; in fact, your relationship may have lingered in the platonic zone for years before either of you admitted to deeper feelings. Intellectually, you’re kindred spirits, both reveling in cutting edge ideas with a sci-fi twist. Laid-back Aquarius chills out Aries‘ glamazon, and the two of you could spend most of your time in flip-flops and beachwear. Aries pushes cool-headed Aquarius to live life more passionately. While you love to debate, you both have volatile tempers that explode unpredictably. Check each others’ temperatures before you start teasing or arguing a point. Private Aries hates crowds (unless you’re performing in front of them). Aquarius longs to create an extended family of your ten thousand friends. Aries will need to open up more to people Aquarius introduces you to. Aquarius will need to stop letting random friends crash date nights. Let the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to more of a buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways."
  },
  {
    "firstsign": "pisces",
    "secondsign": "aries",
    "text": "When Aries and Pisces come together for love or any kind of relationship, it’s dynamic but also fiery! These two ‘head-cases’ are imaginative and cerebral, which can lead to brooding and resentment at times. An Aries-Pisces relationship is never boring, since you both understand each others’ need for intellectual stimulation. A total head trip! Aries rules the brain and Pisces rules the imagination. When the two of you put your minds together, magic manifests into reality. Whether you’re renovating a home together, starting a business, or planning to sail around the world on a catamaran, dreams have a funny way of happening for you two…and fast! Aries starts the project and Pisces has the patience to finish it, but you collaborate well. You’re both prone to brooding spells, which can be problematic if they happen on the same day. Aries can shore up Pisces with a pep talk, while Pisces brings the chicken soup for Aries’ soul. The main difference lies in how you navigate disagreements. Warrior Aries goes headfirst into battle, while passive Pisces disappears at the first sight of conflict. Aries will need to employ some anger management or your beloved Fish could swim away forever. Pisces must learn to be direct about disagreements—the Ram CAN take it! Too close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation."
  },
  {
    "firstsign": "taurus",
    "secondsign": "taurus",
    "text": "When Taurus and Taurus come together for love or any kind of relationship, it’s solid as a rock! These two traditionalists love to plan for the future, which can also lead to boredom in the bedroom. A Taurus-Taurus relationship is grounded, stabilizing and practical, since you both understand each other’s need for long-term security. Sweet and stable you have the potential to make it for the long haul here. Practical magic becomes the grand theme of this love affair, as two Taurus traditionalists unite. You both love to plan, and discussing the orderly way your future will unfold could quickly become pillow talk for the two of you. Well-built homes, family values, farm-fresh food on the table…this relationship has a salt of the Earth quality to it. Before you hire the wedding band, and start picking out China patterns, make sure you reveal your rebellious sides to each other. Otherwise, they could make a resentful and raging appearance that leads to a costly breakup. You both love being comfortable (like an old pair of slippers?), but this combo could turn into a total snoozefest if you don’t make an effort to challenge each other’s automatic processes and inherited belief systems. Taurus and Taurus are both earth signs.\nHome sweet home…or humdrum? As two grounded earth signs, you are both seeking security, consistency and a bond that’s built to last. Tradition and integrity are important—in each other, you find the stability you crave. Soon enough, you’ll ease into pleasant routines and rituals together. Structure and routine come naturally to earth signs. Whether you’re running a business or a family together, your ability to “keep it simple” is one of your shared earthy superpowers. This rock-solid combo can create a lovely legacy that stands the test of time.\n"
  },
  {
    "firstsign": "gemini",
    "secondsign": "taurus",
    "text": "When Taurus and Gemini come together for love or any kind of relationship, it’s dynamic yet structured. These two signs couldn’t be any more different, which is exactly what excites you both. Chemistry is explosive between you, as you learn each other’s ways. A Taurus-Gemini relationship is a challenge, albeit an exciting one! Stop the insanity! Stable, grounded Taurus gets an exhilarating roller-coaster ride from ever-changing Gemini who, in turn, gets some much-needed structure from the zodiac’s Bull. Finding equilibrium is not easy in this matchup, but that’s part of the fun for you both. Debates are lively between you, and may even be your preferred (albeit odd) way of flirting with each other. Sexual chemistry is smoking hot, as touchy-feely Taurus brings Gemini out of the intellectual space, and Gemini’s kinkiness gets Taurus’ dirty mind a whirring. Taurus insists on time-tested principles while Gemini stirs the pot with edgy theories. You’re not exactly opposites, but you’ll wonder often how you wound up with each other. You often work better as a second or third marriage, when Gemini has sown those wild oats and Taurus has already lived out the Normal Rockwell family fantasy. You’ll meet each other on the playground and have fun pushing each other on the swings instead of pushing each other out of a plane with a questionably-operable parachute on your backs. Astrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words.\nBecause of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field."
  },
  {
    "firstsign": "cancer",
    "secondsign": "taurus",
    "text": "When Taurus and Cancer come together for love or any kind of relationship, it’s a soul-stirring match made in heaven! These two domestic doyennes have an affinity for homespun sensuality and a love for cooking and entertaining. A Taurus-Cancer relationship is traditional and family-oriented, since you both understand each other’s need for security and stability. Adorable soulmates are you! Like a pair of high school sweethearts who reunited on Facebook (or married days after graduation), there’s a homespun quality to your combo. Taurus and Cancer are both security-minded, traditional, and family-oriented which makes this an ideal matchup for building a legacy together. Domestic bliss is the grand theme for you two. Your home could double as a music studio or art gallery for the works you inspire in each other. While your nest will be blessed, it can also become an insular bubble, sheltering you from the world. If you aren’t careful, you could lose your edge, so make an effort to socialize and participate in community activities as a couple. Having individual friends and interests is also a healthy must for this matchup. Don’t let your career paths suffer because you’d rather stay in bed all day, wrapped in each other’s arms. Taurus is earth and Cancer is water.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too.\nThere are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic."
  },
  {
    "firstsign": "leo",
    "secondsign": "taurus",
    "text": "When Taurus and Leo come together for love or any kind of relationship, it’s sensual and luxurious! These two pleasure-seeking signs love the finer things in life, which can lead to over-indulgence. A Taurus-Leo relationship has head-turner status, since you both know how to work a room together. Luxury loving Leo and sensual Taurus know how to enjoy the good life together. You both have a larger-than-life presence that commands attention. Heads will turn when you step into the room, and you’ll play this up to the hilt. Family is the air you both breathe, and you’re capable of creating a lively home together. Leo nurtures the children’s creativity while Taurus lays down the structure, plans, and rules. While Leo tends to be the bigger earner, hand those paychecks over to Taurus who is the better budgeter of the two. An expensive combo, this challenging match could cost you both a pretty penny.  Strong-willed, you’ll find each other to be a sexy thrill…but when the Leo ego meets the Taurus stubborn streak, the battles can be epic. Both of you need to learn to say “uncle!”or your sparks could burn down the proverbial house. There’s never a dull moment between you two, which tends to work better for adrenaline-junkie Leo than chilled out Taurus. Handle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. A battle can erupt as one of you strives for freedom while the other craves consistency. But if you learn to appreciate your differences, then you can offer what the other one is missing. The worldly fire sign will have a predictable home base to return to, lovingly tended to by the earth sign partner. In exchange, the earth sign will avoid getting stuck in a stagnant rut because the fire sign will encourage growth and adaptation. Earth signs are sensual and practical, and impulsive fire signs can benefit from their grounded approach. In this relationship, the fire sign can learn to slow down and savor the moment, rather than rushing off to the next big thing. \n\n"
  },
  {
    "firstsign": "virgo",
    "secondsign": "taurus",
    "text": "When Taurus and Virgo come together for love or any kind of relationship, it’s grounding but also a bit neurotic! These two sensual creatures shower each other in affection and gifts, which can sometimes lead to disagreements over spending. A Taurus-Virgo relationship is stabilizing since you are both earth signs. Pump up the slow jams! It’s a match made in earth sign heaven when sensual Taurus meets generous Virgo. You’ll spoil each other with creature comforts and affection will never be in short order. Taurus maps out the master plan for how the relationship unfolds: budget, first house, children, large family wedding (not necessarily in that order). Virgo happily steps in to serve that vision, bringing new meaning to domestic bliss. Taurus’ tastes run toward the finer things while Virgo will happily scoop up necessities from the local Goodwill. The difference in your material values can become problematic unless Taurus cools down the label-whoring and Virgo is willing to be polished and refined a bit. The medicine cabinet may be a source of contention as Taurus overloads on beauty products and Virgo obsessively collects herbal remedies and prescriptions. Yes, you’re both a tad neurotic…especially when it comes to aging. Find outside interests that keep you feeling young, so your fears of fine lines don’t become a gorge that divides you from one another. Home sweet home…or humdrum? As two grounded earth signs, you are both seeking security, consistency and a bond that’s built to last. Tradition and integrity are important—in each other, you find the stability you crave. Soon enough, you’ll ease into pleasant routines and rituals together. Structure and routine come naturally to earth signs. Whether you’re running a business or a family together, your ability to “keep it simple” is one of your shared earthy superpowers. This rock-solid combo can create a lovely legacy that stands the test of time. The challenge? Getting stuck in a rut. Your life can become stagnant if you don’t refresh your worldview periodically by traveling, learning new philosophies or inviting fresh faces into your circle. Together, you may become too iron-fisted and conservative, which others will find intimidating. Because the earth element rules the physical world, you can also become overly materialistic and status-driven. Or you may indulge your senses by eating, drinking and accumulating possessions, forgetting to work on spiritual and emotional development. Too much of the tried-and-true can also prevent you from evolving with the times. Earth-sign pairings must view change and risk as an opportunity rather than a threat. Compromise is also a skill that needs extra work here. Earth signs stand their ground, but they can also stubbornly dig in their heels. If you turn that intractable nature on each other, it can be an endless war—with nobody willing to budge!"
  },
  {
    "firstsign": "libra",
    "secondsign": "taurus",
    "text": "When Taurus and Libra come together for love or any kind of relationship, it’s beautifying and harmonious, but also superficial at times. These two pleasure-seekers love the finer things in life, but you’ll want to be sure you share the same values too. A Taurus-Libra relationship is warming and welcoming, since you are both equally charming and disarming. Both Taurus and Libra are ruled by Venus, the planet of beauty and harmony. As a couple, you’re charm personified…and easy on the eyes to boot. Flowers, music, designer clothes…you love everything top-of-the-line and custom ordered. If you create a family together, your home will likely become the warm and inviting hub for holiday celebrations. Great on the surface, but what’s beneath that? Your relationship may focus too much on the superficial, however, so make sure you share common values before you say, “I do.” Indecisive Libra can frustrate organized Taurus by refusing to give a straight “yes” or “no” to the Bull’s elaborate plans. Taurus is more of a homebody than Libra, and likes everything neat as a pin. Libra’s habit of strewing clothes about the room after a night of back-to-back social engagements could be a major sticking point. Taurus is earth and Libra is air.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words. Because of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field."
  },
  {
    "firstsign": "scorpio",
    "secondsign": "taurus",
    "text": "When Taurus and Scorpio come together for love or any kind of relationship, opposites attract as passion is ignited! These two privacy-seeking signs prefer the comforts of their own home, which can lead to isolation if you don’t force yourselves to get out from time to time. A Taurus-Scorpio relationship can be sexy even through the mundane, since you both turn each other on with constructive criticism. Opposites attract…and burn with erotic charm! Like a pair of under-the-radar celebrities, your relationship often evolves in the most private of places. For both Scorpio and Taurus, your home is your castle…the kind with a drawbridge and a crocodile-filled moat. You live powerful lives in the outside world, and thus, you need to escape. There’s plenty of spicy stuff going on behind closed doors however, even if there’s a danger of becoming too insular as a couple. Sensual Taurus snaps sexy Scorpio out of “power games” mode, creating a safe space for vulnerability. Scorpio provides the security that quells Taurus’ abandonment issues. Ahhh. You’re both music lovers and stellar cooks, so entertaining as a couple will be a four-star experience for your lucky guests. Both of your signs have a penchant for revenge—and if someone does you wrong, watch out! You won’t stop until the other person has PAID. Hell hath no fury like a Scorpio or Taurus scorned! Too much time in your bubble can breed contempt. If you don’t leave your nest every now and again (and nurture independent interests!), you can turn on each other with “constructive criticism.” If you find yourself focusing on the other’s flaws, let it be a sign…it’s time to separate from each other for a few hours! For the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too."
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "taurus",
    "text": "When Taurus and Sagittarius come together for love or any kind of relationship, it may look odd on paper but it can also be a very complementary match! Taurus helps wandering Sagittarius establish roots while Sag encourages the Bull to take more risks. A Taurus-Sagittarius relationship is ideal for childrearing, since you both prioritize education and higher learning. Where you click:\nReally? A somewhat quizzical matchup, you’re as different as dusk and dawn. Nonetheless, if Taurus’ old-fashioned values manage to dovetail with the Sagittarius free spirit, the result can be a lively and long-lasting combo. Taurus keeps the home fires burning while Sagittarius wanders and hunts. The Archer motivates the Bull to be more ambitious and take a few risks here and there. Taurus teaches Sagittarius the joys of family…possibly something Sag wouldn’t have considered otherwise. As parents, you provide an interesting blend of stability and excitement for your kids, but education will be a top priority for your brood. Where you clash:\nFinancially, you’re also as different as they come, and money could be a sore spot in your relationship. Taurus wants to invest in a house, while Sag would rather rent in case moving to another city with one week’s notice ever becomes an option. Taurus believes in quality-made, long-lasting products (organic a plus), while trendy Sagittarius is swept away by impulse shopping for colorful clothes, trinkets, and housewares.  Economically, you two may crash and burn before they learn how to manage your vastly different approaches to spending and saving. Get in bed with a financial advisor stat if you want to enjoy retirement as a couple…and actually have enough funds to stop working one day! Handle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "taurus",
    "text": "When Taurus and Capricorn come together for love or any kind of relationship, it’s solid as a rock! These two security-seeking earth signs love to plan for the future, which could dwindle the romantic vibes over time. A Taurus-Capricorn relationship is traditional and family-oriented, since you both understand each other’s need for stability. Solid as a rock! This relationship is built to last. Both Taurus and Capricorn are traditional, hardworking, and blessed with success. As a couple you quickly become the pillars of your community and may even play a parental role for various members of your extended families. You both love to plan for the future. During a hot and heavy romp, you’re likely to discuss subjects like where to send the kids for private school. Never mind that “the kids” haven’t been born yet! For the two of you, life is a giant goal sheet that’s waiting to be filled. The flaw in your whole operation? The two of you might forget to live in the moment…which is where true romance exists. Spontaneity can become scarce here, but if you allow for it (heck, PLAN for it), the eternal flame of your love will blaze on. Date nights…OUTSIDE OF THE HOUSE…are a passion-fueling must, especially if they provide a chance for you both to wear couture pieces from your elegant wardrobes. Taurus and Capricorn are both earth signs\nHome sweet home…or humdrum? As two grounded earth signs, you are both seeking security, consistency and a bond that’s built to last. Tradition and integrity are important—in each other, you find the stability you crave. Soon enough, you’ll ease into pleasant routines and rituals together. Structure and routine come naturally to earth signs. Whether you’re running a business or a family together, your ability to “keep it simple” is one of your shared earthy superpowers. This rock-solid combo can create a lovely legacy that stands the test of time. The challenge? Getting stuck in a rut. Your life can become stagnant if you don’t refresh your worldview periodically by traveling, learning new philosophies or inviting fresh faces into your circle. Together, you may become too iron-fisted and conservative, which others will find intimidating. Because the earth element rules the physical world, you can also become overly materialistic and status-driven. Or you may indulge your senses by eating, drinking and accumulating possessions, forgetting to work on spiritual and emotional development. Too much of the tried-and-true can also prevent you from evolving with the times.\n\n"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "taurus",
    "text": "When Taurus and Aquarius come together for love or any kind of relationship, it’s passionate but also aggressive! These two opposites couldn’t be any more different, though you can balance each other out when you play to your strengths. You can find balance in a Taurus-Aquarius relationship by exploring your different conversation styles. You’re as different as oil and water. Still, there’s a spicy chemistry between your vastly different signs…at least for a while. Aggressive Taurus pushes cool-headed Aquarius to the edge of reason, causing a much-needed snap in the Water Bearer. Finally, some passion reveals itself in Aquarius, who will feel more alive after being provoked by Taurus’ button-pushing conversational style. In turn, Aquarius brings a refreshing breeze to the “red bull” when the famous Taurus temper starts to flare. Huh? It’s a true mystery how traditional Taurus and space cadet Aquarius wound up on the same planet…much less in the same bedroom. Ideologically it’s a tricky matchup as Taurus prefers black-and-white reason, while Aquarius wants to endlessly pontificate on the spectrum of grays. You’ll need to give each other lots of space and independence to keep this one alive. Taurus is earth and Aquarius is air\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words.\nBecause of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field. So, how can you strike a balance? You work together best when the air sign brings exciting ideas to the table and the earth sign builds them into a tangible reality. The air sign partner will also have to make a more dedicated effort to follow through on promises. Some measure of routine and consistency will have to be followed—even if the air sign abhors tradition. One solution for breaking up the “monotony” of, say, yet another family Christmas? Let the social air sign plan the parties, playlists, decorations, menu and other creative flourishes. And allow for some new faces to be added to the guest list. That way, the dueling needs for novelty AND consistency will both be satisfied.\n\n"
  },
  {
    "firstsign": "pisces",
    "secondsign": "taurus",
    "text": "When Taurus and Pisces come together for love or any kind of relationship, it’s ethereal and dreamy! These two sensual signs are poetry in motion, which can also mean that your heads get stuck up in the clouds at times. A Taurus-Pisces relationship appreciates life’s guilty pleasures, but watch for excess as you indulge together. A dreamy duo! As a couple, you are poetry in motion. Pisces floats through the ethereal realms wearing permanent rose-colored glasses. Taurus flows through the sensual realm, but with a practical plan printed out on a pocket-sized Excel spreadsheet. Connecting Pisces’ dreams to Taurus’ can-do spirit can either lift you to new heights or send you crashing from the sky. For all of Taurus’ best efforts, a tendency to lose touch with reality is a hallmark of this matchup. Pisces can bring out Taurus’ hedonistic wild streak…which is more down n’ dirty than the buttoned up Bull initially reveals. Having outside people to provide reality checks will keep this relationship grooving along happily. Cool it with the drinking, overeating, and other deadly sins that seem so alluring when the two of you get together. Taurus is earth and Pisces is water.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too.\nThere are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable!"
  },
  {
    "firstsign": "gemini",
    "secondsign": "gemini",
    "text": "When Gemini and Gemini come together for love or any kind of relationship, it’s unpredictable and moody! These two over-analyzers love a healthy debate, which can also lead to heated arguments. A Gemini-Gemini relationship works because you both understand each other’s quirks. Get the psychiatrist on the phone! When the zodiac’s Twins pair up there are at least four people in the relationship…and possibly more. This wildly unpredictable combo has an uncanny way of working. Who else would understand your need to collect Japanese action figures at age 40, or that storage unit you rented out (and maybe even lived in for a few weeks) just to house your beloved collection of vintage clothes? If you accept your own quirks, loving another Gemini won’t be hard. Issues arise when kids come into the picture. Who will be the stable grownup that provides structure and consistency that children need? The maturing phase this brings could be a buzzkill for your romance if you don’t work out some sort of plan. Hey, maybe your parents could move in upstairs. Then, the entire family can keep on playing…your favorite thing to do! Make sure you don’t foist an overly responsible role onto your offspring (as in “their parents’ parents”) by sharing TMI during your mood swings or allowing them to see you work through your issues in Gemini debate-and-overanalyze style.\n\nLet’s take a road trip! Ooh, yay! And then we’ll hop a standby flight or go skydiving. Yes yes yes! By the way, I just scored two Hamilton tickets—surprise! We’re going to New York! Put two spontaneous air signs together, and you might just get an exciting, non-stop barrage of conversation and ideas. But do any of these grand schemes actually happen? That’s the challenge in a double air-sign duo—and a noble one you might both just rise to! Your social signs both crave novelty. You’ll be the first in line to try the buzzy new restaurant, see a trending new band or get the latest iPhone upgrade. In fact, you might be the pair camped outside the Apple store, entertaining the crowds with a magic show or a mobile coffee cart.\n\nTrouble begins in an air-sign love match when there’s TOO much change. You may be constantly on the move and never really rooted. There can be flakiness, as you blow with the wind, or run as “hot and cold” as the air temperatures outside. You both easily get scattered, and your million friends, activities and separate interests could make it hard to find quality time. Air signs are communicative, but not always compassionate—your arguments can turn into brutal verbal dagger-flinging.\n\n"
  },
  {
    "firstsign": "cancer",
    "secondsign": "gemini",
    "text": "When Gemini and Cancer come together for love or any kind of relationship, it’s dynamic but also sensitive. These two polar opposites actually complement each other well, since you both have many different layers to your moods. A Gemini-Cancer relationship is stimulating, since you both share an affinity for cultural activities and socializing. An oddball combo that often ends up in marriage, the Gemini and Cancer match is full of shape shifting as Gemini’s multiple personalities meet the Crab’s ever-changing moods. At least the dull moments will be rare. Both signs adore children and you’ll co-parent playfully as a duo.Your shared love of cultural activities can be the glue that holds you together. Museums, amusement parks, food festivals! Together you’ll try them all.\nGregarious Gemini has social ADD, and loves bantering with strangers at the bar. Domestic Cancer prefers to throw intimate dinner parties in the company of a tight-knit circle of friends. With your vastly different social styles, you’ll need to work harder to find common ground. Going out together? Gemini should not leave Cancer alone in the corner (nor should Cancer expect Gemini to be a wallflower all night). While your child-rearing can be compatible to a point, trouble in paradise can emerge when Gemini wants to send the kids to a Waldorf School while Cancer insists on the private education that has been family tradition for generations. Creative compromises will have to be struck if your union is going to last. Gemini is air and Cancer is water.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common!\n\nYour social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity. The benefits of this match is an opportunity for growth. Since water signs can be TOO “in their feelings,” the cooler, rational air sign partner can teach them the power of detaching. The water sign will learn how to take things less personally, laugh at themselves and lighten up. In exchange, the water sign can teach the glib air sign to dive into their depths more, rather than being overly superficial or turning everything into a joke. The water sign may create a cozy, beautiful home, while the air sign fills it with interesting guests, music and art. Both of these elements can be “culture vultures,” and may bond of dissecting a documentary film, singing karaoke (you both could have encyclopedic knowledge of lyrics) or even traveling.\n\n"
  },
  {
    "firstsign": "leo",
    "secondsign": "gemini",
    "text": "When Gemini and Leo come together for love or any kind of relationship, it’s dramatic and playful! These two theatrical signs love adventure and a wide array of interests, which can lead to overly-packed schedules. A Gemini-Leo relationship is full of hopes and dreams, because you both understand each other’s outsized ambition. An endless playdate! Life is a costume party for you two theatrical signs. If you share the same grand plan (favorite locations for “settling down,” similar taste in friends) you’ll easily flow from playmates to soulmates without forsaking an ounce of fun. Kids only fuel the adventure for you, since your eternally youthful signs will experience a second childhood through the eyes of your offspring. If you don’t procreate, you’ll need a creative project to keep the fires burning. Start a band or a business together with lots of sparkle and glamour. At last, you’ve found a person who dreams as big as you do and shares your super-sized appetite for life. Gemini is a hopeless multi-tasker while Leo has been plotting an empire since grade school. Try to get a disco nap in here and there, or you could exhaust yourselves with all that “go, go, go!” energy. In this coupling, it’s easy to get scattered among too many different projects and interests. When will you have time for each other? With your packed schedules, you could start to feel like ships passing in the night. Arguments could drag on for hours since neither of you backs down when proving a point! Gemini is air and Leo is fire.\nLet the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways. The key difference between your elements is that air signs tend to be more cool, detached and cerebral, while fire signs are more impulsive, emotional and expressive. In essence, air signs are more “head” while fire signs are more “heart.” When a disagreement erupts, the air sign will want to discuss it objectively, which can seem cold and uncaring to the worked-up and reactive fire sign partner, who may talk in circles or get defensive, frustrating the solution-oriented air sign. At times, the fire sign may feel exhausting—too much energy! And when the air sign gets stuck in analysis paralysis, the fire sign will lose patience. (“Just do something already!” says fire.) In nature, air can feed a fire, helping it spread—just as an air sign partner fans the flames of the fire sign’s passion. Fire heats up the chilly air, and fire signs help air signs warm up and take chances. But another fire-air scenario is blowing out a match—one gust of wind from the wrong direction and the flame goes out."
  },
  {
    "firstsign": "virgo",
    "secondsign": "gemini",
    "text": "When Gemini and Virgo come together for love or any kind of relationship, it’s neurotic and erotic! These two communicators are skilled conversationalists, since they share Mercury as their planetary ruler. A Gemini-Virgo relationship is intellectually stimulating because you share a passion for uncovering new and exciting information. Equal parts neurotic and erotic, this challenging matchup often ends in matrimony. Analyzing and exchanging ideas is an electrifying experience for you two thinkers, who are both ruled by the planet Mercury. Your love affair centers around a shared passion for discovering information. If you can turn life together into an endless treasure hunt, you’ll fill your home with fascinating artifacts…each with an elaborate story behind it.  While communication is your common ground, you approach the world from vastly different angles. Gemini is an impulsive air sign who parses data at the speed of a hi-tech server. Virgo is practical, grounded, and not prone to rushing through anything. You’re both a tad neurotic, and can activate each other’s anxieties by pointing out everything that might go wrong with a plan or idea. Learning to enjoy the art of “comfortable silence” will be the saving grace for you two chatterboxes. Otherwise you might just talk each other out of the relationship. Gemini is air and Virgo is earth.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words.\n\nBecause of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field.\n\nSo, how can you strike a balance? You work together best when the air sign brings exciting ideas to the table and the earth sign builds them into a tangible reality. The air sign partner will also have to make a more dedicated effort to follow through on promises. Some measure of routine and consistency will have to be followed—even if the air sign abhors tradition. One solution for breaking up the “monotony” of, say, yet another family Christmas? Let the social air sign plan the parties, playlists, decorations, menu and other creative flourishes. And allow for some new faces to be added to the guest list. That way, the dueling needs for novelty AND consistency will both be satisfied. The earth sign will have to be more flexible and open-minded, willing to try the new ideas the air sign introduces. Earth partners will have to learn to be more spontaneous instead of always insisting on a plan. In return, the air sign must stick to SOME part of the plan, not changing the time, showing up late or inviting random tagalongs at the last minute."
  },
  {
    "firstsign": "libra",
    "secondsign": "gemini",
    "text": "When Gemini and Libra come together for love or any kind of relationship, two social butterflies have met their match! But these indecisive signs might struggle to reach conclusions together, since you are both prone to changing your minds. A Gemini-Libra relationship moves at two different speeds, but having a good time together will strengthen your bond. This is an easy attraction between two air signs, which could turn into a lifelong courtship dance. Social butterflies by nature, you quickly become the King and Queen of the scene; that couple who always pops up in society magazines or in the backdrop of a photo at an art opening, restaurant opening, indie rock concert, and so on. If you go the marriage and kids route, you’ll do it with an unconventional twist, with plenty of entertainment value for the two of you. Do you like the blue? Or the red? Or maybe we should just go with purple? Help! When chameleon Gemini meets indecisive Libra there are never REALLY any certainties…except for the fact that you’re instantly comfortable around each other. Fun is the glue that holds you together, but that bond may not have the strength to keep you connected for the long haul. Fast moving Gemini can upset patient Libra’s equilibrium, while Libra’s messy habits can unnerve OCD Gemini. Force yourselves to instill a few grounding practices in your lives or you’ll scatter like the wind. Gemini and Libra are both air signs.\nLet’s take a road trip! Ooh, yay! And then we’ll hop a standby flight or go skydiving. Yes yes yes! By the way, I just scored two Hamilton tickets—surprise! We’re going to New York! Put two spontaneous air signs together, and you might just get an exciting, non-stop barrage of conversation and ideas. But do any of these grand schemes actually happen? That’s the challenge in a double air-sign duo—and a noble one you might both just rise to! Your social signs both crave novelty. You’ll be the first in line to try the buzzy new restaurant, see a trending new band or get the latest iPhone upgrade. In fact, you might be the pair camped outside the Apple store, entertaining the crowds with a magic show or a mobile coffee cart.\n\nTrouble begins in an air-sign love match when there’s TOO much change. You may be constantly on the move and never really rooted. There can be flakiness, as you blow with the wind, or run as “hot and cold” as the air temperatures outside. You both easily get scattered, and your million friends, activities and separate interests could make it hard to find quality time. Air signs are communicative, but not always compassionate—your arguments can turn into brutal verbal dagger-flinging.\n\nFor best results, strike the right amount of change and stability. Our aunt and uncle, both air signs, were constantly renovating their home—and while it often added chaos, it seemed to keep them together. Their home was like a modern art gallery with constantly rotating exhibits—and the hotspot for massive parties, thrown “just because.” Entertaining is a huge connective factor for two air signs. Your combined social circle can rival the circumference of the earth! In fact, you’re at your best when enjoying the company of many different people. Air signs crave constant stimulation (and might even be the pair who pulls off an open relationship). Too many romantic nights-for-two can get boring, so don’t spend excessive time alone together, lapse into lazy homebody mode or rush into cohabitation."
  },
  {
    "firstsign": "scorpio",
    "secondsign": "gemini",
    "text": "When Gemini and Scorpio come together for love or any kind of relationship, it’s intense and dramatic! These two ingenues love a good game of cat and mouse, and always ask plenty of questions. A Gemini-Scorpio relationship is intellectually stimulating, since you both understand the unending quest for the truth. Intrigue! Drama! Intensity! While you both have 20,000 questions, neither one of you is quick to give up answers. When mastermind Gemini meets Scorpio the sleuth, the 007 adventure unfolds. Immediately, you begin probing for clues. For most couples this would be an exhausting turn-off. For Gemini and Scorpio, it’s a total aphrodisiac. As you tease each other with cat and mouse games, dangle hope then snatch it away…the vibe gets HOT! The build-up is often the best part in this match, so don’t stop playing games once you’ve sealed the deal. Private Scorpio prefers the intensity of a “behind closed doors” encounter, while Gemini is an unrepentant flirt and party animal who needs to be seen on the scene with a sexy partner in tow. This can provoke Scorpio’s stinging jealousy and trust issues, causing Gemini to be iced out. Scorpio…don’t turn off your sexy just because you’re “committed” (or as revenge for your Twin’s flirtatious nature). Gemini, set up entertaining hobbies at home so you can enjoy domestic bliss your way while Scorpio lounges on the couch.\nGemini is air and Scorpio is water.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common! Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. Your social habits may need some tweaking to make this work. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity.\n\nThe benefits of this match is an opportunity for growth. Since water signs can be TOO “in their feelings,” the cooler, rational air sign partner can teach them the power of detaching. The water sign will learn how to take things less personally, laugh at themselves and lighten up. In exchange, the water sign can teach the glib air sign to dive into their depths more, rather than being overly superficial or turning everything into a joke. The water sign may create a cozy, beautiful home, while the air sign fills it with interesting guests, music and art. Both of these elements can be “culture vultures,” and may bond of dissecting a documentary film, singing karaoke (you both could have encyclopedic knowledge of lyrics) or even traveling."
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "gemini",
    "text": "When Gemini and Sagittarius come together for love or any kind of relationship, it’s dynamic and engaging! These two expert communicators will never run out of things to discuss. A Gemini-Sagittarius relationship is adventurous, but since you both love to travel it may be hard to pin each other down. As opposite signs, you’re not always compatible, but when you are—WOW! There’s an immediate attraction between you. Gemini rules everyday communication, while Sagittarius rules the “higher mind” of philosophy. You’ll never run out of topics to discuss and debate, which both of you consider a turn-on. If you can work out your travel schedules—or better yet, enjoy each other on your journeys—this will be a wild ride that plays out like the bygone Brangelina fairy tale did, with the global residences, and an international brood of adorable children to boot. Even when your attraction is strong, pinning each other down for an actual date can be the hard part. Your social lives are usually spilling over with activities before you’ve even met. If you’re not committed to a similar vision in life, you may just have to settle for a Facebook connection and occasional dalliances when you both show up in the same port. Both signs can be incurable flirts who enjoy having multiple lovers. Monogamy could quickly feel like monotony since you both crave novelty. You might even instate some “flexible” policies that allow for an outside fling here and there. Gemini is air and Sagittarius is fire.\nLet the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways. The key difference between your elements is that air signs tend to be more cool, detached and cerebral, while fire signs are more impulsive, emotional and expressive. In essence, air signs are more “head” while fire signs are more “heart.” When a disagreement erupts, the air sign will want to discuss it objectively, which can seem cold and uncaring to the worked-up and reactive fire sign partner, who may talk in circles or get defensive, frustrating the solution-oriented air sign. At times, the fire sign may feel exhausting—too much energy! And when the air sign gets stuck in analysis paralysis, the fire sign will lose patience. (“Just do something already!” says fire.) In nature, air can feed a fire, helping it spread—just as an air sign partner fans the flames of the fire sign’s passion. Fire heats up the chilly air, and fire signs help air signs warm up and take chances. But another fire-air scenario is blowing out a match—one gust of wind from the wrong direction and the flame goes out."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "gemini",
    "text": "When Gemini and Capricorn come together for love or any kind of relationship, it’s dynamic and inspiring! These two ambitious signs are pro networkers, and could talk each other’s ears off for hours. A Gemini-Capricorn relationship is intellectually stimulating, since you are both ambitious in your careers. Power couple alert! Ambition is the common ground between Gemini and Capricorn, who both dream of an executive suite as a final destination. Expert networkers, you both know how to work a room and walk out with the VIP connection in your back pocket. Talkative Gemini buzzes a mile a minute while stoic Capricorn can hold silence for epic lengths of time. At last, Gemini has the wise sounding board to vet their gazillion novel ideas. The sensible Sea Goat might be the ONLY person hard-headed Gemini actually listens to! Gemini’s future-forward M.O. can either clash or mesh with Capricorn’s old world values. It’s certainly an intricate dance to behold! Gemini furnishes in mod, Design-Within-Reach-meets-Tokyo-anime style. Capricorn wants a mahogany desk, Buddha statue and stone slab fountain. While kids are usually a part of the master plan, Gemini wants to home school while touring the country. Capricorn wants to instill a sense of tradition and set up camp near childhood friends and family. A middle ground is difficult to reach, but if you open your minds to compromise, you can be ever-inspiring teachers for each other in the journey of life.\nGemini is air and Capricorn is earth.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words. Because of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field.\n\nSo, how can you strike a balance? You work together best when the air sign brings exciting ideas to the table and the earth sign builds them into a tangible reality. The air sign partner will also have to make a more dedicated effort to follow through on promises. Some measure of routine and consistency will have to be followed—even if the air sign abhors tradition. One solution for breaking up the “monotony” of, say, yet another family Christmas? Let the social air sign plan the parties, playlists, decorations, menu and other creative flourishes. And allow for some new faces to be added to the guest list. That way, the dueling needs for novelty AND consistency will both be satisfied. The earth sign will have to be more flexible and open-minded, willing to try the new ideas the air sign introduces. Earth partners will have to learn to be more spontaneous instead of always insisting on a plan. In return, the air sign must stick to SOME part of the plan, not changing the time, showing up late or inviting random tagalongs at the last minute.\n\n"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "gemini",
    "text": "When Gemini and Aquarius come together for love or any kind of relationship, it’s heaven on Earth! These future-forward thinkers share the gift of gab and a love for collaboration and community. A Gemini-Aquarius relationship is stimulating and exciting, because you share a passion for solving life’s great mysteries. It’s soulmate heaven on Earth, Mercury, Venus and Uranus! Like Captain Kirk meeting Princess Leah, it’s bound to be otherworldly when you two sci-fi lovers park your spaceships in the same interplanetary dimension. As fellow seekers, you’re both on a quest to solve life’s mysteries. Why not team up as copilots? Your combined intellectual powers are awe-inspiring. The ideas you come up with together will be nothing short of genius. Gemini is better at starting a project, but stick-to-it Aquarius will take your joint efforts to the finish line bringing financial prosperity for you both. While you romance each other intellectually, neither of you knows quite what to do with those funny things called feelings. Book that couple’s therapist session before the wedding day, as it’s going to take a third party to teach you how to navigate the emotional realm. As co-parents your unpredictable whims make it difficult to create a settled and secure foundation for kids. Gemini and Aquarius are both air signs.\nLet’s take a road trip! Ooh, yay! And then we’ll hop a standby flight or go skydiving. Yes yes yes! By the way, I just scored two Hamilton tickets—surprise! We’re going to New York! Put two spontaneous air signs together, and you might just get an exciting, non-stop barrage of conversation and ideas. But do any of these grand schemes actually happen? That’s the challenge in a double air-sign duo—and a noble one you might both just rise to! Your social signs both crave novelty. You’ll be the first in line to try the buzzy new restaurant, see a trending new band or get the latest iPhone upgrade. In fact, you might be the pair camped outside the Apple store, entertaining the crowds with a magic show or a mobile coffee cart. Trouble begins in an air-sign love match when there’s TOO much change. You may be constantly on the move and never really rooted. There can be flakiness, as you blow with the wind, or run as “hot and cold” as the air temperatures outside. You both easily get scattered, and your million friends, activities and separate interests could make it hard to find quality time. Air signs are communicative, but not always compassionate—your arguments can turn into brutal verbal dagger-flinging.\n\nFor best results, strike the right amount of change and stability. Our aunt and uncle, both air signs, were constantly renovating their home—and while it often added chaos, it seemed to keep them together. Their home was like a modern art gallery with constantly rotating exhibits—and the hotspot for massive parties, thrown “just because.” Entertaining is a huge connective factor for two air signs. Your combined social circle can rival the circumference of the earth! In fact, you’re at your best when enjoying the company of many different people. Air signs crave constant stimulation (and might even be the pair who pulls off an open relationship). Too many romantic nights-for-two can get boring, so don’t spend excessive time alone together, lapse into lazy homebody mode or rush into cohabitation."
  },
  {
    "firstsign": "pisces",
    "secondsign": "gemini",
    "text": "When Gemini and Pisces come together for love or any kind of relationship, it’s surreal and also moody! But these two commitment-phobes actually find common ground together, and this relationship could really withstand the test of time. A Gemini-Pisces relationship is equally harmonizing, since both of your signs represent duality. Welcome to the surreal world. You both prefer fantasy over reality, and will quickly become one another’s creative muse. Both signs are prone to mood swings, so this matchup can be a bit of an emotional roller coaster ride. You’re both “dual” signs—Gemini is symbolized by the Twins, and Pisces by two Fish swimming away from each other. As a result, it can feel like there are four people in this relationship…none of whom can every make a decision that sticks! If you can get past your commitment-phobia, this can be an enduring match that inspires legendary works of art. On most days, Gemini grooves to a club-friendly dance mix while Pisces longs to plunge into a deep house track. Can you discover a common beat? Pisces can find Gemini superficial at times, while Gemini wishes Pisces would just lighten up already! On a constant quest for “The One,” you can both overanalyze a partner instead of just sitting still and enjoying the moment. Your home can also turn into a den of chaos and clutter. You’re both pack rats and will need to purge your collections regularly—or set up an eBay store to create extra income for your nights on the town.\n\nGemini is air and Pisces is water\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common!\n\nYour social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity.\n\nThe benefits of this match is an opportunity for growth. Since water signs can be TOO “in their feelings,” the cooler, rational air sign partner can teach them the power of detaching. The water sign will learn how to take things less personally, laugh at themselves and lighten up. In exchange, the water sign can teach the glib air sign to dive into their depths more, rather than being overly superficial or turning everything into a joke. The water sign may create a cozy, beautiful home, while the air sign fills it with interesting guests, music and art. Both of these elements can be “culture vultures,” and may bond of dissecting a documentary film, singing karaoke (you both could have encyclopedic knowledge of lyrics) or even traveling."
  },
  {
    "firstsign": "cancer",
    "secondsign": "cancer",
    "text": "When Cancer and Cancer come together for love or any kind of relationship, it’s domestic bliss at its finest. These two homespun Crabs love cooking and mothering, which can be smothering at times! A Cancer-Cancer relationship is nurturing and heartwarming, since you both understand each other’s care-taking ways. White picket fence fantasy in action! The union of two Cancers is the picture of domestic bliss…and it’s anything but boring on your home front. You’ll inspire each other to create AND procreate. As the children pop out one after another, you’re simultaneously retiling the bathroom, planting an organic vegetable garden, preparing nightly gourmet dishes in your Le Creuset cookware, refining your ten year savings plan, and scrapbooking every memorable moment to Martha-Stewart-approved perfection. You both have a motherly quality to you, which can become smothering at times. Who’s gonna bring the raw, masculine energy? Too much homespun coziness can be like cold water on your libidos. Don’t let your home life overshadow your outside interests and ambitions…not if you want to keep having sex for other purposes than making yet another baby for your brood. Cancer and Cancer are both water signs.\nInto the depths you go! Two highly sensitive and perceptive water signs can get VERY comfortable with each other—and fast. You could go from dating to renting a U-Haul in short order, especially if you meet each other’s parents and families and earn the seal of approval. Home is everything to the water sign. Your solitude-seeking souls need to retreat to a private and intimate hub after being out in the wider world. You could host the holidays, rent the beach house where everyone communes, have kids crawling out of every nook. A water sign home is likely to feature cozily-appointed guest bedrooms and lots of spare pillows and blankets. Your nostalgic signs both cherish family and tradition. Since you don’t trust easily, you may have a small, tight-knit circle of friends that you keep for life. If you open a business together, you’ll create a “family” vibe at the office. (And yes, they’ll be secretly subject to loyalty tests.) While it’s nice to feel so safe together, comfort has its limits. If you wrap yourselves too tightly in this security blanket, it can smother you. A water sign relationship can devolve into a parent-child dynamic (complete with baby talk and cloyingly cutesy nicknames) and self-destructive indulgence in food, drink and self-soothing activities like shopping. You can get TOO deep “in your feelings,” stirring up a tsunami of emotions that can spiral into rage and even abuse if you aren’t careful. Your powerful moods may overlap or spiral out of control if not managed. Although water can be placid and beautiful, it can actually do great damage. To avoid creating a hurricane, you’ll both need to talk to a therapist or a grounded friend before unleashing your anger, resentment or jealousy on each other. Water that doesn’t move can become stagnant and toxic—and a water-sign couple may become possessive and fearful of change to their own detriment.\n\n\n"
  },
  {
    "firstsign": "leo",
    "secondsign": "cancer",
    "text": "When Cancer and Leo come together for love or any kind of relationship, it’s a balance of stage manager meets superstar. These two family-oriented signs both love to entertain, making for some epic holidays spent at your casa. A Cancer-Leo relationship will also need to compromise, since your energies are as different as night and day.\nBehind every superstar (Leo) there is a highly intelligent manager (Cancer), and the two of you become a force to be reckoned with. Let Leo play the ingenue while Cancer makes shrewd deals and plays agent. Not that the Crab can’t be a star in his/her own right—and together you can cut a dramatic figure, keeping your clan and crew entertained for hours. Both signs are devoted to family and long for a large, noisy brood to play with. With your shared love of party planning, you two might just wind up hosting Thanksgiving, Christmas and Easter at your house. Cancer is ruled by the moon, and Leo is ruled by the sun, and indeed the two of you can be as different as night and day. While you’re both Alphas, Cancer prefers to rule the roost with quiet control, while showboating Leo turns every announcement into a flashbulb popping media circus. Leo should create opportunities for Cancer to shine every now and again—particularly in the company of Cancer’s closest friends. Make sure your relatives mesh well before you start booking wedding dates. Otherwise, arguments over where to spend the holidays could send you sailing right to divorce court. Cancer is water and Leo is fire\nToo close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation. So, how can the traditionalist water sign and the risk-taking fire sign happily coexist? The fire sign will have to enter the water sign’s world of family visits, downtime at home, returning to the same vacation spots and hanging with a small crew of lifelong friends…even if that feels limiting or stagnant. In return, the water sign will have to embrace adventure, travel, meeting new people (and being social when they do!), risk and changing up their comfortable routines from time to time. Parents can be a big sticking point, as the water sign partner is often dutifully close to theirs while the fire sign may have left home at 18 and never looked back. In nature, water can put out a fire, which can either control a raging wildfire (good) or douse a vibrant flame (not so good). Fire can warm up cold water, but it can also make it boiling and steaming mad! Too much fire can even cause water to evaporate, just as an overly dominant fire sign can cause the less aggressive water sign to “disappear” in the relationship.\n\n"
  },
  {
    "firstsign": "virgo",
    "secondsign": "cancer",
    "text": "When Cancer and Virgo come together for love or any kind of relationship, two sentimental spirits may have just met their match. These two security-seeking signs give each other the space they need to feel safe. A Cancer-Virgo relationship is nurturing, since you both understand each other’s need for domestic bliss. Packrat powers unite! When Cancer the collector meets Virgo the hoarder, you might have to rent out a storage unit before you rent out a wedding hall. You’re both natural treasure hunters who love to gather unique conversation pieces with sentimental value. Family-oriented, your values dovetail naturally, and you may even bring out a conservative streak in one another. Saving and planning for the future is a favorite pastime for you security-minded signs. You can build quite the nest egg as a couple! While you’ll have plenty of backup for those rainy days, how about enjoying the sunny ones? You’ll have to work harder to see the overflowing glass you create instead of always working for more, more, more. Allow yourself to swig from this cup at least once a year. Traveling to historical destinations as a couple is the key to romance…even if you find it nearly impossible to leave the cozy home you’ve created together. Cancer is water and Virgo is earth.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too.\n\nThere are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable!\n\n\n"
  },
  {
    "firstsign": "libra",
    "secondsign": "cancer",
    "text": "When Cancer and Libra come together for love or any kind of relationship, it’s elegant and sensual, but also emotional. These two peaceful signs both avoid conflict like the plague, which can lead to harbored resentment. A Cancer-Libra relationship is highly sensitive, since you both tend to internalize your feelings. Gracious and elegant, you’re both the picture of class. You’ll create a gorgeous home together filled with art, music, sentimental treasures, and a gourmet kitchen for your foodie fantasy fulfillment. Keep the freshly whipped crème fraiche and organic strawberries on the nightstand. Cooking elaborate meals and touring the best restaurants is part of your courtship dance and makes for ongoing sensual delights as you build a life together. Neither one of you deals with conflict well—or willingly—which can cause resentment to fester. Cancer may hold a silent grudge for years as Libra cluelessly bops along. Libra may avoid addressing issues for fear of hurting sensitive Cancer’s feelings. A few sessions with a couple’s therapist would be money well spent, as you learn a format for addressing the difficult issues. Otherwise you could wind up being the couple that never fights but wakes up one day to discover the magic is gone. Cancer is water and Libra is air.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common! Your social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity.\n\nThe benefits of this match is an opportunity for growth. Since water signs can be TOO “in their feelings,” the cooler, rational air sign partner can teach them the power of detaching. The water sign will learn how to take things less personally, laugh at themselves and lighten up. In exchange, the water sign can teach the glib air sign to dive into their depths more, rather than being overly superficial or turning everything into a joke. The water sign may create a cozy, beautiful home, while the air sign fills it with interesting guests, music and art. Both of these elements can be “culture vultures,” and may bond of dissecting a documentary film, singing karaoke (you both could have encyclopedic knowledge of lyrics) or even traveling.\n\n\n\n"
  },
  {
    "firstsign": "scorpio",
    "secondsign": "cancer",
    "text": "When Cancer and Scorpio come together for love or any kind of relationship, two kindred spirits may have just met their match. These two sensitive beings are both afraid to let their guard down, but feel safe with each other. A Cancer-Scorpio relationship is nurturing and healing, since you allow each other to let your guard down. Emotional soulmates, you feel an instant “kindred spirit” connection with each other. Cancer and Scorpio are both innately possessive, terrified of feeling vulnerable, and automatically suspicious of everyone you meet. Although you have the good sense to hide these qualities from most people, with each other you can actually ‘fess up to your fears and find solace in one another’s arms. The nurturing vibes overflow between you, leading you to the happy family life you both crave. Jealousy alert! You’re two of the most possessive signs—and when you tread over each other’s trust lines, look out. But you’ve both developed hardened outer shells to shield your vulnerability, and cracking through that could be an epic feat. Since you’re both uber-sensitive, discussions about feelings could become epic and endless. Give each other a “Get Out of Jail Free” card every now and again. Dropping a grudge is not a sign of weakness, it’s a necessity with two people who are as proud and power-obsessed as you both are! Scorpio are both water signs.\nInto the depths you go! Two highly sensitive and perceptive water signs can get VERY comfortable with each other—and fast. You could go from dating to renting a U-Haul in short order, especially if you meet each other’s parents and families and earn the seal of approval. Home is everything to the water sign. Your solitude-seeking souls need to retreat to a private and intimate hub after being out in the wider world. You could host the holidays, rent the beach house where everyone communes, have kids crawling out of every nook. A water sign home is likely to feature cozily-appointed guest bedrooms and lots of spare pillows and blankets. Your nostalgic signs both cherish family and tradition. Since you don’t trust easily, you may have a small, tight-knit circle of friends that you keep for life. If you open a business together, you’ll create a “family” vibe at the office. (And yes, they’ll be secretly subject to loyalty tests.) While it’s nice to feel so safe together, comfort has its limits. If you wrap yourselves too tightly in this security blanket, it can smother you. A water sign relationship can devolve into a parent-child dynamic (complete with baby talk and cloyingly cutesy nicknames) and self-destructive indulgence in food, drink and self-soothing activities like shopping. You can get TOO deep “in your feelings,” stirring up a tsunami of emotions that can spiral into rage and even abuse if you aren’t careful. Your powerful moods may overlap or spiral out of control if not managed. Although water can be placid and beautiful, it can actually do great damage. To avoid creating a hurricane, you’ll both need to talk to a therapist or a grounded friend before unleashing your anger, resentment or jealousy on each other. Water that doesn’t move can become stagnant and toxic—and a water-sign couple may become possessive and fearful of change to their own detriment."
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "cancer",
    "text": "When Cancer and Sagittarius come together for love or any kind of relationship, it’s eat, drink and be merry ’til the end! These two culinary masters love good food and company. A Cancer-Sagittarius relationship is fueled by big belly laughs, since you understand each other’s unique sense of humor. Both Cancer and Sagittarius love to laugh and your wry comedic quips can keep each other in stitches. Sharing wicked humor about life’s oddities keeps you from noticing how fundamentally different you are. Whizzes in the kitchen, you’ll throw legendary dinner parties as a couple…although it’s anyone’s guess who your motley crew of friends will get along! Family-wise, Cancer wants to settle down while Sagittarius wants to roam around, so this matchup may work better as a second or third marriage for the Crab. Good thing Sagittarius makes an excellent stepparent!\n\nA night of drinking, dancing, and sidesplitting jokes could find you both tumbling into bed together…and that’s when things start unraveling. Sagittarius wants to giddy-up and get it on, ignoring Cancer’s need for emotional validation and slow, sensual touch. Then, there’s the half-unpacked suitcase sitting next to Sag’s bed…or the smiling family photo perched on Cancer’s nightstand. Wait…who are you again? You’ll be endlessly enigmatic to one another, which could be an aphrodisiac or a deal breaker.\n\nCancer is water and Sagittarius is fire.\nToo close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation.\n\nSo, how can the traditionalist water sign and the risk-taking fire sign happily coexist? The fire sign will have to enter the water sign’s world of family visits, downtime at home, returning to the same vacation spots and hanging with a small crew of lifelong friends…even if that feels limiting or stagnant. In return, the water sign will have to embrace adventure, travel, meeting new people (and being social when they do!), risk and changing up their comfortable routines from time to time. Parents can be a big sticking point, as the water sign partner is often dutifully close to theirs while the fire sign may have left home at 18 and never looked back. In nature, water can put out a fire, which can either control a raging wildfire (good) or douse a vibrant flame (not so good). Fire can warm up cold water, but it can also make it boiling and steaming mad! Too much fire can even cause water to evaporate, just as an overly dominant fire sign can cause the less aggressive water sign to “disappear” in the relationship."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "cancer",
    "text": "When Cancer and Capricorn come together for love or any kind of relationship, it’s a perfect blend of divine feminine and masculine energies. These two traditionalists can easily fall into conventional roles, which can also lead to a codependent dynamic. A Cancer-Capricorn relationship is nurturing, since you both strive for balance between care-taking and providing. A perfect balance! Cancer is the mother sign, Capricorn the daddy, making you feel like long-lost partners, destined to start a family together. Since the two of you are opposite signs, there’s plenty of chemistry between you. This is a soulmate matchup made in domestic heaven. You’ll naturally fall into step with one another. Capricorn builds the empire while Cancer keeps the home fires burning. While you can lapse into traditional roles, you may both enjoy playing them. As the relationship evolves, Cancer may grow resentful, especially if they sacrificed a personal dream only to feel like Capricorn’s secretary or baby nurse. As Capricorn designs the family crest, make sure you include both sides in equal measure. Sure, all this tradition may seem like strange hullabaloo to Cancer, but if you don’t insert yourself into the picture, take-charge Cap may unwittingly paint you into a very tiny corner. Cancer is water and Capricorn is earth.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too. There are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable!\n\n"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "cancer",
    "text": "When Cancer and Aquarius come together for love or any kind of relationship, it’s awkward at first with plenty of lasting potential. There is a lot to be learned from each other, which can help you to appreciate your differences. A Cancer-Aquarius relationship is nurturing, since you both understand each other’s parenting styles should you decide to have children. There’s much to learn from each other…if you don’t bolt from the initial awkwardness too quickly. Cancer teaches Aquarius the power of intimacy and the hidden joys of focusing on one (and only one) person at a time. Aquarius pulls Cancer out of that protective shell and holds your Crab claw as you navigate the crowds, and add more and more people to your Facebook friends list. Popular Aquarius can help ease Cancer’s social anxiety, while the Crab will help Aquarius relish the joys of cooking and entertaining at home. Parenting can be the common ground that plays to both of your strengths—and seals your bond. Cancer’s tender, nurturing style and Aquarian’s eternal youth can turn family life into a sentimental adventure that you creatively script together. Bizarre! You’re not exactly opposites…you’re simply fascinated by discovering a person so far flung from your comfort zone. Outgoing, edgy Aquarius is like a sci-fi enigma to shy, traditional Cancer, who’d rather lie on the couch reading a thick classic novel than visit any of Aquarius’ inter-dimensional watering holes. There’s a good chance you’ll be spending more time apart than together in this matchup. Since you both relish personal space, this could work out, provided Aquarius can earn Cancer’s trust…no easy feat! Cancer is water and Aquarius is air.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common! Your social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity."
  },
  {
    "firstsign": "pisces",
    "secondsign": "cancer",
    "text": "When Cancer and Pisces come together for love or any kind of relationship, the emotional floodgates have opened! These two sensitive souls as passionate and empathetic, which can lead to decisions based on feelings over logic. A Cancer-Pisces relationship is fueled by fantasy, since you understand how to navigate each other’s psychic waters. Fantasy fulfillment! It’s smooth sailing for you two water signs, who can swim to the depths of passion in the sea of love. Empathetic Pisces creates a safe space for private Cancer to open up and share vulnerably. The Crab’s domestic stability is a dependable harbor for the chaotic Fish to swim home to. As long as you don’t get sucked too far into the emotion ocean, you’ll find it easy to flow from courtship to matrimony without breaking stride. At some point, you’ll need to set feelings aside and embrace logic—otherwise, you’ll never make those practical decisions that keep your relationship moving forward. Your differing approach to finances can be the disruptive element here. Penny-pinching Cancer can’t rest easy without a nest egg and retirement account in the bank. Pisces will spend “on spec,” amassing more IOUs than expected and drowning in debt. Bring a financial advisor in to the picture early on, so you can map out a plan and have those savings automatically deducted from your paychecks before Pisces fritters them away. Cancer: don’t forget about the entertainment budget. The kids’ college fund is important, yes, but Pisces needs to download music, buy a bottle of wine for friends, and splurge on shoes every now and then in order to feel alive. Cancer and Pisces are both water signs.\nInto the depths you go! Two highly sensitive and perceptive water signs can get VERY comfortable with each other—and fast. You could go from dating to renting a U-Haul in short order, especially if you meet each other’s parents and families and earn the seal of approval. Home is everything to the water sign. Your solitude-seeking souls need to retreat to a private and intimate hub after being out in the wider world. You could host the holidays, rent the beach house where everyone communes, have kids crawling out of every nook. A water sign home is likely to feature cozily-appointed guest bedrooms and lots of spare pillows and blankets. Your nostalgic signs both cherish family and tradition. Since you don’t trust easily, you may have a small, tight-knit circle of friends that you keep for life. If you open a business together, you’ll create a “family” vibe at the office. (And yes, they’ll be secretly subject to loyalty tests.)\n\nWhile it’s nice to feel so safe together, comfort has its limits. If you wrap yourselves too tightly in this security blanket, it can smother you. A water sign relationship can devolve into a parent-child dynamic (complete with baby talk and cloyingly cutesy nicknames) and self-destructive indulgence in food, drink and self-soothing activities like shopping. You can get TOO deep “in your feelings,” stirring up a tsunami of emotions that can spiral into rage and even abuse if you aren’t careful. Your powerful moods may overlap or spiral out of control if not managed. Although water can be placid and beautiful, it can actually do great damage. To avoid creating a hurricane, you’ll both need to talk to a therapist or a grounded friend before unleashing your anger, resentment or jealousy on each other. Water that doesn’t move can become stagnant and toxic—and a water-sign couple may become possessive and fearful of change to their own detriment."
  },
  {
    "firstsign": "leo",
    "secondsign": "leo",
    "text": "When Leo and Leo come together for love or any kind of relationship, it’s glamorous and exciting. These two royal Lions have a soul-stirring, passionate connection, which can also lead to drama. A Leo-Leo relationship is ripe with chemistry, since you both understand each other’s primal instincts. An exciting royal matchup! When the zodiac’s King of the Jungle meets his Lion Queen, there’s a primal, soulmate recognition. At last—a creative, glamorous, visionary partner to fill the empty throne by your side. Plus, the sex is H-O-T! Mirrors on the ceiling, anyone? Call in the set designers, rent out the stadium! When you merge your larger-than-life plans, nothing short of supersized will fulfill you. Your shared love of history, family celebrations, and endless education can bond you more permanently over time.\nThis is all well and good as long as you’ve secured funding. Your lusty appetites often trump your practical planning abilities, and you’ll need some outside support with setting up a solid foundation for your future. Check those egos at the door. If one Leo’s star rises higher than the other, the competition can get fierce…and ugly. Make sure your connection runs beyond the superficial. While you love being the enviable power couple, image alone won’t keep you together, especially on a bad hair day. \nLeo and Leo are both fire signs.\nThe heat is on! Your Sun signs are both in the element of fire. This exothermic combination can move from zero to soulmate in mere seconds, as you recognize a kindred spirit in this compatible astrology love match. But as quickly as your lusty wildfire blazes up, it can also sweep out of control…or go from sizzle to fizzle. Your tempers can be as scorching as your sex, so while you might set off an inferno in the sheets, your arguments can also be legendary.\nRemember: Civilization began when man learned to make, tend and control fire. It cooks our meals, keeps us warm, powers everything. But by nature, fire does not WANT to be controlled, and neither do fire signs. This relationship must leave room for individuality, exploration and autonomy within safe boundaries. Making and keeping a commitment has to be handled delicately, so as not to lose the spark or smother the flame.\nAs a same-element couple, you may need to make a conscious effort to not get stuck in a rut or even a competitive dynamic. Spending time with friends, coworkers or relatives of another element can introduce a more balancing energy. For example, a grounded earth sign can help two hotheaded fire signs look before leaping. An objective air sign reminds you to step back from your heated emotions and knee-jerk reactions. And a sensitive water sign can help you tune into your nostalgic side instead of glossing over your feelings.\n"
  },
  {
    "firstsign": "virgo",
    "secondsign": "leo",
    "text": "When Leo and Virgo come together for love or any kind of relationship, it’s as hot as it is cold. But your differences are what attracted you to each other in the first place! A Leo-Virgo relationship is successful once balance is achieved, since you both appreciate each other’s unique qualities. A hot-and-cold relationship. Fiery Leo is a bright star to behold for earthy, practical Virgo, but the show doesn’t stop there. Your radically different styles make the other stop and reflect. Leo adds a rainbow bright splash of color to Virgo’s un-dyed natural fibers. Life feels vibrant again with the Lion’s appearance! Selfless service is Virgo’s M.O., which awakens Leo’s generous nature and paves the way to a more purposeful life for the zodiac’s lion. Both of you can dramatize an “issue” to no end, but here, again, there’s a natural symbiosis. Leo plays cheerleader to pessimistic Virgo; levelheaded Virgo steps into the therapist’s role, mirroring back Leo’s angst until a breakthrough is reached. This is a safe emotional harbor for both of you, albeit a somewhat boring one for Leo. The stage is well set for family life, as Virgo will help the kids with their math homework and Leo will get down with the finger painting and bedtime stories. Your basic temperaments may always clash in some way. Leo loves to work the party circuit, while Virgo prefers smaller, intimate gatherings. Leo’s supersized ambitions can activate budget-conscious Virgo’s anxieties. Accept your different styles…and keep separate bank accounts if you want to make this last. Leo is fire and Virgo is earth\nHandle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing.\n\nThe worldly fire sign will have a predictable home base to return to, lovingly tended to by the earth sign partner. In exchange, the earth sign will avoid getting stuck in a stagnant rut because the fire sign will encourage growth and adaptation. Earth signs are sensual and practical, and impulsive fire signs can benefit from their grounded approach. In this relationship, the fire sign can learn to slow down and savor the moment, rather than rushing off to the next big thing. And the fire sign can help the earth sign take more chances in life. Think in terms of nature: dirt can smother a fire, and fire can scorch the earth. But in order to build a fire and maximize its creative powers, there must be a steady ground beneath the flames. "
  },
  {
    "firstsign": "libra",
    "secondsign": "leo",
    "text": "When Leo and Libra come together for love or any kind of relationship, it’s glamorous and decadent. These two social butterflies love to rub elbows with the VIPs, which could lead to jealousy if not kept in check. A Leo-Libra relationship is ripe with excitement, since you both love to dress up and paint the town red. A stellar matchup of two social butterflies! Both Leo and Libra love dressing to the nines, attending glamorous events, and rubbing elbows with the rich and famous. It’s likely you met on the party circuit or at a dance club, both of you working the room like a pair of exotic peacocks. Beyond your standout style, you have similar values. You’re sentimental, family-oriented, and fiercely protective of the ones you love. Leo can be a bit of a spotlight hog, while Libra is the sign that rules partnership. While non-confrontational Libra won’t compete for the stage, Leo should play the supporting cast mate on a regular basis. Help Libra to shine by providing pep talks and the occasional tough love push. Gregarious and lively, you both tend to talk more than you listen. Neither one of you is a fan of discussing unpleasant issues, but you’ll need to develop coping skills for the conflicts that naturally arise in life. Should you have children, beware of becoming a pair of stage parents…let your kids find their own path instead of viewing them as an extension of your identity as a couple. Leo is fire and Libra is air.\nLet the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways.\nThe key difference between your elements is that air signs tend to be more cool, detached and cerebral, while fire signs are more impulsive, emotional and expressive. In essence, air signs are more “head” while fire signs are more “heart.” When a disagreement erupts, the air sign will want to discuss it objectively, which can seem cold and uncaring to the worked-up and reactive fire sign partner, who may talk in circles or get defensive, frustrating the solution-oriented air sign. At times, the fire sign may feel exhausting—too much energy! And when the air sign gets stuck in analysis paralysis, the fire sign will lose patience. (“Just do something already!” says fire.) In nature, air can feed a fire, helping it spread—just as an air sign partner fans the flames of the fire sign’s passion. Fire heats up the chilly air, and fire signs help air signs warm up and take chances. But another fire-air scenario is blowing out a match—one gust of wind from the wrong direction and the flame goes out.\n"
  },
  {
    "firstsign": "scorpio",
    "secondsign": "leo",
    "text": "When Leo and Scorpio come together for love or any kind of relationship, it’s magnetic and spicy! But these two control freaks love to have things their way, which can lead to epic power struggles. A Leo-Scorpio relationship is inspiring and assuring, since you both understand each other’s highly confident personas. If you can celebrate each other’s magnetic personalities, you’ll have a spicy match on your hands that lasts for at least a season (if not a lifetime). Unfortunately, it’s all too easy for each of you to become threatened by the other’s projected confidence. Remind yourselves of this daily: you don’t need to break each other down to ensure that you won’t be left in the lurch. Besides, sex this good doesn’t come along every day. With Leo’s show-stopping personality and Scorpio’s behind-the-scenes alchemy, you can blend your talents into a moneymaking hit that supports a family for generations to come.\nCaution: power struggles ahead! Both Leo and Scorpio need to feel like number one. Trouble is, neither sign is quick to give up control. Different approaches to childrearing also cause some consternation…and often another battleground for control. Woosh! If resolving conflicts on a daily basis is your idea of an aphrodisiac, go ahead and get hitched. Otherwise, you might be better off as business partners or just friends. Leo is fire and Scorpio is water.\nToo close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation. So, how can the traditionalist water sign and the risk-taking fire sign happily coexist?\nThe fire sign will have to enter the water sign’s world of family visits, downtime at home, returning to the same vacation spots and hanging with a small crew of lifelong friends…even if that feels limiting or stagnant. In return, the water sign will have to embrace adventure, travel, meeting new people (and being social when they do!), risk and changing up their comfortable routines from time to time. Parents can be a big sticking point, as the water sign partner is often dutifully close to theirs while the fire sign may have left home at 18 and never looked back. In nature, water can put out a fire, which can either control a raging wildfire (good) or douse a vibrant flame (not so good). Fire can warm up cold water, but it can also make it boiling and steaming mad! Too much fire can even cause water to evaporate, just as an overly dominant fire sign can cause the less aggressive water sign to “disappear” in the relationship.\n\n"
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "leo",
    "text": "When Leo and Sagittarius come together for love or any kind of relationship, it’s dynamic and a whole lotta fun! These two party people know how to work a room, which could lead to many wild nights about town. A Leo-Sagittarius relationship is passionate and inspiring, since you both understand each other’s ambitious ways. Fire sign fantasy fulfillment! Both Sagittarius and Leo are irrepressible party people, and together, you’ll work a room like A-list celebutantes. Passion is plentiful in this matchup—from your lively conversations to your red-hot romps in the sack. You’ll pump up each other’s confidence and inspire one another to take bold leaps, especially when it comes to your ambitious careers. At times, Leo requires more attention than impatient Sagittarius cares to give. Sagittarius’ blunt comments can pierce sensitive Leo to the core. Although you make playful, adventurous parents, kids can try your patience and interrupt your adult playtime in ways you both resent. Hire a live-in babysitter or set up home base near grandparents so you can enjoy your much-needed grownup getaways. You’re both a bit overly optimistic when it comes to finances so install that money management software before you go on one of your notorious spending sprees. Leo and Sagittarius are both fire signs.\nThe heat is on! Your Sun signs are both in the element of fire. This exothermic combination can move from zero to soulmate in mere seconds, as you recognize a kindred spirit in this compatible astrology love match. But as quickly as your lusty wildfire blazes up, it can also sweep out of control…or go from sizzle to fizzle. Your tempers can be as scorching as your sex, so while you might set off an inferno in the sheets, your arguments can also be legendary. Remember: Civilization began when man learned to make, tend and control fire. It cooks our meals, keeps us warm, powers everything. But by nature, fire does not WANT to be controlled, and neither do fire signs. This relationship must leave room for individuality, exploration and autonomy within safe boundaries. Making and keeping a commitment has to be handled delicately, so as not to lose the spark or smother the flame. "
  },
  {
    "firstsign": "capricorn",
    "secondsign": "leo",
    "text": "When Leo and Capricorn come together for love or any kind of relationship, it’s a fairy tale come true. These two image-conscious signs will dress to impress, which can also lead to vanity and a superficial dynamic. A Leo-Capricorn relationship is ripe with chemistry, since you both understand each other’s desires for power couple status. Like Ken and Barbie, you’re a good-looking pair, but is the connection more plastic than fantastic? It’s going to take a while to figure that out. First, you’ll have to get past the fierce attraction to each other’s images. Capricorn wants the corner office; Leo longs for a throne. Your shared love of achievement and impressive ambition sends power-couple fantasies dancing through your heads. If you’re out to conquer the same goal, your combined skills make you quite an awesome force to behold. Leo works the room like a media-trained pro while Capricorn runs the quality control department of your joint operations. Your sexual chemistry is the strongest force of all, so get ready for some legendary lovemaking! Your temperaments can be as different as night and day. Capricorn may find Leo’s party chatter superficial, while sunny Leo may wish Capricorn would stop being such a pessimist. You’re both devoted to family, but Capricorn is a die-hard traditionalist while Leo wants to redraw the family crest with a 64-pack of Crayolas. Leo is fire and Capricorn is earth.\nHandle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing. The worldly fire sign will have a predictable home base to return to, lovingly tended to by the earth sign partner. In exchange, the earth sign will avoid getting stuck in a stagnant rut because the fire sign will encourage growth and adaptation. Earth signs are sensual and practical, and impulsive fire signs can benefit from their grounded approach. In this relationship, the fire sign can learn to slow down and savor the moment, rather than rushing off to the next big thing. And the fire sign can help the earth sign take more chances in life. Think in terms of nature: dirt can smother a fire, and fire can scorch the earth. But in order to build a fire and maximize its creative powers, there must be a steady ground beneath the flames."
  },
  {
    "firstsign": "aquarius",
    "secondsign": "leo",
    "text": "When Leo and Aquarius come together for love or any kind of relationship, it’s lighthearted and fun! These two party animals crave excitement and adventure, which can also lead to dramatic emotional outbursts. A Leo-Aquarius relationship is incredibly stimulating, since you both understand each other’s carefree and childlike ways. A wild ride! You’re both big kids at heart and game playing is something you never tire of. How about paintball? Skydiving? Heck, even joining a local co-ed softball team is better than toying with each other’s minds! You definitely need activities to keep you focused on the positive aspects of being a couple. If you can funnel your passionate natures toward elaborate adventures, you might just become lifelong playmates. It’s a somewhat dangerous game when you two opposites attract. At first, it’s unbridled passion and a 24-hour party that never stops. Then, Leo drops the R-bomb: relationship…a little too soon to be justified by commitment shy Aquarius. Hotheaded Leo and rebellious Aquarius can revert to childish and destructive behavior when your animal instincts are ignited. As the Water Bearer strings the Lion along in an elaborate courtship dance, tempers flare, emotional outbursts ignite, and you both wonder how you “lost it” so quickly.  When Aquarius finally surrenders to Leo’s desires for monogamy, the script may flip with Leo pulling away as Aquarius stalks in frustration. Leo is fire and Aquarius is air.\nLet the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways. The key difference between your elements is that air signs tend to be more cool, detached and cerebral, while fire signs are more impulsive, emotional and expressive. In essence, air signs are more “head” while fire signs are more “heart.” When a disagreement erupts, the air sign will want to discuss it objectively, which can seem cold and uncaring to the worked-up and reactive fire sign partner, who may talk in circles or get defensive, frustrating the solution-oriented air sign. At times, the fire sign may feel exhausting—too much energy! And when the air sign gets stuck in analysis paralysis, the fire sign will lose patience. (“Just do something already!” says fire.) In nature, air can feed a fire, helping it spread—just as an air sign partner fans the flames of the fire sign’s passion. Fire heats up the chilly air, and fire signs help air signs warm up and take chances. But another fire-air scenario is blowing out a match—one gust of wind from the wrong direction and the flame goes out.\n\n"
  },
  {
    "firstsign": "pisces",
    "secondsign": "leo",
    "text": "When Leo and Pisces come together for love or any kind of relationship, it’s dramatic and dynamic! These two creative ingenues love romance and spirituality, which could also lead to emotional outbursts. A Leo-Pisces relationship is limitless, since you both understand each other’s desire for success and stardom. A dramatic duo! Leo is an aggressive, dynamic fire sign who loves to bask in the limelight. Pisces is a pensive, private water sign who prefers to create magic from behind-the-scenes. You’ll fall naturally into step with each other as partners, but you’re both incredibly bossy. Make sure you have your own realms to rule—Leo is the director, Pisces is the producer, but you’re equal partners here…capiche? You’re both creative, romantic, and wildly imaginative. This works well for you as a couple, provided you find a constructive outlet to funnel your combined energy toward. Think big: building empires, creating large families, traveling the world on charitable missions. If the relationship becomes the lightning rod for your emotional tornadoes this matchup can send you both running to the psych ward. Some spiritual evolution is a pre-requisite to success, so go do that inner work before you walk down the aisle. Once you’ve both read that stack of self-help books (and maybe even done a little time with a great therapist), the relationship could flow into a dreamy Love Boat cruise that docks permanently in paradise. Leo is fire and Pisces is water.\nToo close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation.\nSo, how can the traditionalist water sign and the risk-taking fire sign happily coexist? The fire sign will have to enter the water sign’s world of family visits, downtime at home, returning to the same vacation spots and hanging with a small crew of lifelong friends…even if that feels limiting or stagnant. In return, the water sign will have to embrace adventure, travel, meeting new people (and being social when they do!), risk and changing up their comfortable routines from time to time. Parents can be a big sticking point, as the water sign partner is often dutifully close to theirs while the fire sign may have left home at 18 and never looked back. In nature, water can put out a fire, which can either control a raging wildfire (good) or douse a vibrant flame (not so good). Fire can warm up cold water, but it can also make it boiling and steaming mad! Too much fire can even cause water to evaporate, just as an overly dominant fire sign can cause the less aggressive water sign to “disappear” in the relationship.\n"
  },
  {
    "firstsign": "virgo",
    "secondsign": "virgo",
    "text": "When Virgo and Virgo come together for love or any kind of relationship, it’s dynamic and grounding. These two conversationalists also have an affinity for homespun sensuality, which could mean you never want to leave the house! A Virgo-Virgo relationship is intellectually stimulating, since you both understand each other’s analytical and systematic ways. As Virgos, you’re both dynamic, opinionated conversationalists and the sparks of passion may fly in your initial exchange. At best, you’ll remember that being the sign service CAN apply to lovemaking too. Since you’re both so hands-on, enjoy giving each other full-body massages. Then, turn your crafty natures to planting organic gardens, refurbishing a turn-of-the-century farmhouse, and homeschooling your large brood of children with experimental teaching styles. That homespun energy might just land you a reality show if you get crafty enough! \nYawn…stretch. Although this relationship may start off as flavorful as a pint of Jamocha Almond Fudge, there’s a risk of it melting down to Vanilla very quickly. Your date nights are romantic and luxurious. Then…the home visits begin. One of you may be a breathtaking packrat, the other an OCD minimalist. Regardless, you both have systems of order and control that you’re in no way eager to surrender. At worst, you’ll ignite each other’s moralizing, goody-goody streak. Enter the imaginary preacher, hovering over your bed while you experience “original sin.” Wait…or was that just your pillow talk?\nVirgo and Virgo are both earth signs.\nHome sweet home…or humdrum? As two grounded earth signs, you are both seeking security, consistency and a bond that’s built to last. Tradition and integrity are important—in each other, you find the stability you crave. Soon enough, you’ll ease into pleasant routines and rituals together. Structure and routine come naturally to earth signs. Whether you’re running a business or a family together, your ability to “keep it simple” is one of your shared earthy superpowers. This rock-solid combo can create a lovely legacy that stands the test of time. The challenge? Getting stuck in a rut. Your life can become stagnant if you don’t refresh your worldview periodically by traveling, learning new philosophies or inviting fresh faces into your circle. Together, you may become too iron-fisted and conservative, which others will find intimidating. Because the earth element rules the physical world, you can also become overly materialistic and status-driven. Or you may indulge your senses by eating, drinking and accumulating possessions, forgetting to work on spiritual and emotional development. Too much of the tried-and-true can also prevent you from evolving with the times. Earth-sign pairings must view change and risk as an opportunity rather than a threat. Compromise is also a skill that needs extra work here. Earth signs stand their ground, but they can also stubbornly dig in their heels. If you turn that intractable nature on each other, it can be an endless war—with nobody willing to budge!"
  },
  {
    "firstsign": "libra",
    "secondsign": "virgo",
    "text": "When Virgo and Libra come together for love or any kind of relationship, it’s a meeting of the mild-mannered minds! These two aesthetes love good food and culture, which can make nights out on the town fun and interesting. A Virgo-Libra relationship is laid back, which can also lead to complacency. \nVirgo and Libra are attracted to each other’s mild-mannered sides, but it will take work to keep this interesting. Advice: steer clear of suburbia. Your match-up works best if you live in a bustling, cosmopolitan environment. Since you’re both bookworms and music lovers, you’ll have easy access to live shows and intellectually stimulating cultural activities that keep your relationship from becoming a snoozefest. Since you won’t be able to resist the mellow side of life, create “Zen and the Art of Your Relationship” by joining a yoga studio together, attending meditation retreats, and incorporating raw foodism into your culinary lexicon. Analysis paralysis alert! You’re both prone to pontificating endlessly, but as a couple you tend to be more talk than action. Neither one of you likes to be uncomfortable, so this slow jam could grind to a halt quickly. There’s a threat of becoming a pair of “armchair revolutionaries” here, or worse yet, lifeless couch potatoes. Who’s going to bring the fire? The passion? The zeal?\nVirgo is earth and Libra is air.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words.\nBecause of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field.\nSo, how can you strike a balance? You work together best when the air sign brings exciting ideas to the table and the earth sign builds them into a tangible reality. The air sign partner will also have to make a more dedicated effort to follow through on promises. Some measure of routine and consistency will have to be followed—even if the air sign abhors tradition. One solution for breaking up the “monotony” of, say, yet another family Christmas? Let the social air sign plan the parties, playlists, decorations, menu and other creative flourishes. And allow for some new faces to be added to the guest list. That way, the dueling needs for novelty AND consistency will both be satisfied. The earth sign will have to be more flexible and open-minded, willing to try the new ideas the air sign introduces. Earth partners will have to learn to be more spontaneous instead of always insisting on a plan. In return, the air sign must stick to SOME part of the plan, not changing the time, showing up late or inviting random tagalongs at the last minute."
  },
  {
    "firstsign": "scorpio",
    "secondsign": "virgo",
    "text": "When Virgo and Scorpio come together for love or any kind of relationship, it’s spiritually stimulating! These two privacy-seeking souls love to dive deep, which can lead to fascinating conversation. A Virgo-Scorpio relationship is detail-oriented, since you both understand each other’s analytical ways. A soulful entwining! Both Virgo and Scorpio are reflective, spiritual, and fascinated by the tiny details of life. Although your signs tend to be private, you’ll enjoy discovering the inner workings of each other’s minds. You both probe at a pace the other is comfortable with…not too fast, not too slow. Communication and friendship are the basis for your connection. Although you may not be “rip your clothes off” attracted to each other, there’s a sweet stability to your matchup that is its own brand of sexy. Instead of obsessing about when the other will call or text, you can focus your energies towards creating a meaningful life together. Your home will be a comfortable base camp for your separate interests, and you’ll easily coexist. Elaborate dinner parties are your forte as a couple. If you decide to have children, you’ll be patient and devoted parents who provide their kids with a worldly, well-rounded education.\nObsession alert? You are two of the most analytical signs in the zodiac. And while you might not fixate on each other, you can both get wicked tunnel vision when life feels awry. You could end up playing therapist for each other, which will strain your connection. Your shared need for control could devolve into power struggles if you don’t mark your turf. If one of you wants the dishes done just so, or the shower scrubbed to pristine perfection, then make that YOUR job. Critically holding each other to your impeccable standards is a recipe for nitpicking—a total romance killer.\nVirgo is earth and Scorpio is water.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too. There are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable!"
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "virgo",
    "text": "When Virgo and Sagittarius come together for love or any kind of relationship, it’s intellectually stimulating! These conversationalists find common ground over holistic health and philosophical thinking. A Virgo-Sagittarius relationship will need to make room for compromise, since you both could travel for extended periods of time. It’s a sexy meeting of the minds when analytical Virgo pairs up with philosophical Sagittarius. The two of you can pontificate for hours about everything from world politics to your childhood issues with your fathers. Conversation is an aphrodisiac for both signs, and after another “great talk,” sultry Sagittarius quickly lures Virgo into the bedroom. You may be best off as friends-with-benefits, a status your signs can amicably uphold for years. If you do marry, there will be many compromises to make, which may even include separate residences and long-distance dating for periods of time. Natural health and global activism are common ground. Bond through meaningful adventures like running charity marathons, digging wells in Africa with cleanwater.org, and ringing in the New Year with Costa Rican yoga retreats.\nThis match is an intellectually stimulating experience that can cool off quickly. Once between the sheets, your different styles begin to emerge. Sensual, serious Virgo is a giver in bed and may spend hours pleasuring hedonistic Sagittarius. When it’s time to return the favor, Sagittarius is already snoozing with a Cheshire Cat grin on their face. Traditional Virgo likes to take it slow; future-forward Sagittarius is forever on the go. Virgo may never feel secure in this combo while Sagittarius will feel anchored by Virgo’s need for routine, order and stability.\nVirgo is earth and Sagittarius is fire.\nHandle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing. The worldly fire sign will have a predictable home base to return to, lovingly tended to by the earth sign partner. In exchange, the earth sign will avoid getting stuck in a stagnant rut because the fire sign will encourage growth and adaptation. Earth signs are sensual and practical, and impulsive fire signs can benefit from their grounded approach. In this relationship, the fire sign can learn to slow down and savor the moment, rather than rushing off to the next big thing. And the fire sign can help the earth sign take more chances in life. Think in terms of nature: dirt can smother a fire, and fire can scorch the earth. But in order to build a fire and maximize its creative powers, there must be a steady ground beneath the flames. "
  },
  {
    "firstsign": "capricorn",
    "secondsign": "virgo",
    "text": "When Virgo and Capricorn come together for love or any kind of relationship, it’s grounding and feels like home! These two security-seeking signs love tradition, which can also lead to boredom and complacency. A Virgo-Capricorn relationship is incredibly stimulating, since you both understand each other’s need for structure. Call up the officiant; book the wedding hall! You’ve met your tradition-loving, Earth sign soulmate, the person you “just know” you were meant to spend the rest of your life with. It’s finally safe to break out those long lists of expectations you’ve both been refining since age 5. Go ahead. Compare goal sheets, financial projections, the architectural blueprints for the house you’ll eventually build. Other people find this odd, for Virgo and Capricorn, it’s nothing short of an aphrodisiac. While other match-ups may lure you to the wild side, this combo is about building stable structures. At worst, you can veer towards vanilla…a flavor you both like well enough, but look out! When a spicier someone rolls into town, you may be tempted towards an extramarital affair to reconnect with your slumbering life force energy. To avoid this trap, put down those goal sheets once every fiscal quarter. Stop building and just “be.” Better yet, take a Tantric workshop, explore burlesque dancing, or even a little bondage. You’re both a little bound up at times, so bringing out the black leather and studs can unleash your naughty alter egos is a really healthy way. Meow!\nVirgo and Capricorn are both earth signs.\nHome sweet home…or humdrum? As two grounded earth signs, you are both seeking security, consistency and a bond that’s built to last. Tradition and integrity are important—in each other, you find the stability you crave. Soon enough, you’ll ease into pleasant routines and rituals together. Structure and routine come naturally to earth signs. Whether you’re running a business or a family together, your ability to “keep it simple” is one of your shared earthy superpowers. This rock-solid combo can create a lovely legacy that stands the test of time. The challenge? Getting stuck in a rut. Your life can become stagnant if you don’t refresh your worldview periodically by traveling, learning new philosophies or inviting fresh faces into your circle. Together, you may become too iron-fisted and conservative, which others will find intimidating. Because the earth element rules the physical world, you can also become overly materialistic and status-driven. Or you may indulge your senses by eating, drinking and accumulating possessions, forgetting to work on spiritual and emotional development. Too much of the tried-and-true can also prevent you from evolving with the times. Earth-sign pairings must view change and risk as an opportunity rather than a threat. Compromise is also a skill that needs extra work here. Earth signs stand their ground, but they can also stubbornly dig in their heels. If you turn that intractable nature on each other, it can be an endless war—with nobody willing to budge!"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "virgo",
    "text": "When Virgo and Aquarius come together for love or any kind of relationship, you both want to make the world a better place, together! These two humanitarians share the same intellectual pursuits, but you can also butt heads when you become too set in your own ways. A Virgo-Aquarius relationship is incredibly stimulating, since you both understand each other’s high-minded ways. You’ll certainly make a splash in the bedroom, but you may need a rescue boat to pull you back to the surface. That boat could come in the form of a shared intellectual pursuit. Your great minds form a fascinating “think tank,” and together you could solve the string theory or discover a holistic remedy for an infectious disease. Virgo is the sign of community service; Aquarius is the humanitarian. You both want to make the world a better place, and you’ll devote yourselves tirelessly to a mission. Find a common cause and your shared conviction will add depth to your passionate physical chemistry. Ummm…okay. Your matchup leaves people scratching their heads in wonder. How DID you two wind up on the same planet, exactly? Virgo’s natural curiosity seems like neurotic banter in the face of Aquarius’ laid-back cool. It’s a bit like the Titanic crashing into the iceberg. Teaming up on a shared venture can help you soar, as long as you don’t try to “project manage” each other in the process. You may be better in a second (or fifth for Aquarius) marriage, when you don’t have to attempt to raise kids according to your vastly different parenting styles. If children are already in the mix, you may need to work with a couples’ counselor to create a workable compromise for how best to raise them. Virgo is earth and Aquarius is air.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words.\nBecause of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field.\nSo, how can you strike a balance? You work together best when the air sign brings exciting ideas to the table and the earth sign builds them into a tangible reality. The air sign partner will also have to make a more dedicated effort to follow through on promises. Some measure of routine and consistency will have to be followed—even if the air sign abhors tradition. One solution for breaking up the “monotony” of, say, yet another family Christmas? Let the social air sign plan the parties, playlists, decorations, menu and other creative flourishes. And allow for some new faces to be added to the guest list. That way, the dueling needs for novelty AND consistency will both be satisfied. The earth sign will have to be more flexible and open-minded, willing to try the new ideas the air sign introduces. Earth partners will have to learn to be more spontaneous instead of always insisting on a plan. In return, the air sign must stick to SOME part of the plan, not changing the time, showing up late or inviting random tagalongs at the last minute.\n\n\n"
  },
  {
    "firstsign": "pisces",
    "secondsign": "virgo",
    "text": "When Virgo and Pisces come together for love or any kind of relationship, it’s magnetic and nurturing! These two health nuts love holistic healing, which means you both prioritize well-being. Since there is so much care-taking in a Virgo-Pisces relationship, codependency can become an issue. A healthy obsession? You’re magnetically drawn to each other, and a natural care-taking unfolds from the get-go. Virgo will ply illness-prone Pisces with holistic remedies. Pisces’ compassionate listening skills are chicken soup to Virgo’s neurotic soul. Pisces is the perfect muse for sparking Virgo’s creativity while Virgo provides a grounding energy for Pisces’ flights of fancy. You’re both more productive, inventive, and prosperous as a unit. A healthy obsession? You’re magnetically drawn to each other, and a natural care-taking unfolds from the get-go. Virgo will ply illness-prone Pisces with holistic remedies. Pisces’ compassionate listening skills are chicken soup to Virgo’s neurotic soul. Pisces is the perfect muse for sparking Virgo’s creativity while Virgo provides a grounding energy for Pisces’ flights of fancy. You’re both more productive, inventive, and prosperous as a unit. Virgo is earth and Pisces is water\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too.\nThere are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable! Earth signs can seem cold or overly harsh, doling out tough love when water sign feels sensitive. The water sign can get clingy and overly dependent, creating a parent-child dynamic. Make an effort not to lapse into these well-worn roles just because it’s easy. You can also get stuck in a rut of doing the same-old things or being fearful of change together. Bringing in a friend, colleague or family member who’s a more dynamic fire or air sign can help. You might even have a child together who’s a fire or air sign. Instead of treating them like the family misfit, allow them to introduce novel ideas to the clan, and respect their greater need for independence."
  },
  {
    "firstsign": "libra",
    "secondsign": "libra",
    "text": "When Libra and Libra come together for love or any kind of relationship, it’s an instant harmonious connection; a true meeting of the hedonistic minds. Ruled by decadent Venus, these two lovebirds are an enviable couple in social settings, dressed lavishly head-to-toe in the most fashion-forward trends. A Libra-Libra relationship can quickly take a turn toward overindulgence if you’re not careful, since you both have an affinity for the finer things in life. Poetic justice? Quite possibly THE most loving combo on the planet. You’re a double shot of Venus-ruled energy, and it’s a magical dreamscape from the get-go. Beauty, harmony, peace and justice: these are the values that Libras hold dear. If your scales are balanced, you’ll flow through this fairy tale relationship with nary a disagreement along the way. Socially, you’re an enviable couple, always dressed to the nines with a golden halo of good vibes emanating from your sunny personalities. Date Nights are epic affairs and lavish spending is the name of the game. \nBut…TWO people wearing rose colored glasses? This might make for a flowery view on life, but you can quickly become a delusional duo if you don’t plant your designer footwear in the reality zone from time to time. Debt can rack up quickly, and since neither of you likes dealing with conflict, so too can denial. Before the bill collectors come a-knocking, create a pleasurable experience out of working on joint finances. Dress up in vintage loungewear as you pore over Quickbooks; sign utility bill checks with an ostrich feather-tipped pen. Start an entertainment budget for your nights on the town, but have savings auto-deducted from your paychecks in equal measure. With the injection of practical planning skills, you’ll make blissful heads of the household, and provide a secure foundation for yourselves and your prospective family. Libra and Libra are both air signs.\nLet’s take a road trip! Ooh, yay! And then we’ll hop a standby flight or go skydiving. Yes yes yes! By the way, I just scored two Hamilton tickets—surprise! We’re going to New York!\nPut two spontaneous air signs together, and you might just get an exciting, non-stop barrage of conversation and ideas. But do any of these grand schemes actually happen? That’s the challenge in a double air-sign duo—and a noble one you might both just rise to! Your social signs both crave novelty. You’ll be the first in line to try the buzzy new restaurant, see a trending new band or get the latest iPhone upgrade. In fact, you might be the pair camped outside the Apple store, entertaining the crowds with a magic show or a mobile coffee cart. Trouble begins in an air-sign love match when there’s TOO much change. You may be constantly on the move and never really rooted. There can be flakiness, as you blow with the wind, or run as “hot and cold” as the air temperatures outside. You both easily get scattered, and your million friends, activities and separate interests could make it hard to find quality time. Air signs are communicative, but not always compassionate—your arguments can turn into brutal verbal dagger-flinging."
  },
  {
    "firstsign": "scorpio",
    "secondsign": "libra",
    "text": "When Libra and Scorpio come together for love or any kind of relationship, it’s an intriguing connection that magnetizes two polar opposites. These night owls both know how to have a good time, which could quickly fizzle out one you realize your fundamental differences. Secretive Scorpio plays it cool while amorous Libra wears their heart on their sleeve, leading to misunderstandings. A Libra-Scorpio relationship can thrive if you are willing to make some serious compromises for each other. Day meets night and the intrigue begins. Sunny Libra is the zodiac’s flower child, wearing your heart on your paisley-printed sleeve. Brooding Scorpio the mystical spy, clutching your top-secret cards tightly against your black leather vest. Since you’re both night owls and music lovers, you might meet on the dance floor or at a live concert. At first, Libra is flattered by Scorpio’s intense focus…it’s nice to find someone so interested in discovering who you are! Your sexy tango falls out of step when conversational Libra inquires about Scorpio’s life. Scorpio’s cryptic answers and sarcastic remarks are simply not in Libra’s lexicon, and it might feel like Scorpio is playing you for a fool. If Scorpio can drop the defensive posture, this can be a heavenly upward trek through romantic peaks and chart-topping climaxes.  Unfortunately, Libra’s flirtatious personality often provokes Scorpio’s jealousy, and you two can get caught up in a modern day “War of the Roses” before you ever start your ascent. Some major compromises will have to be made. Libra may have to tone down your innate social tendencies and private Scorpio will have to come out of that cave and mingle more often. Don’t expect to be each other’s “everything,” if you want to keep making and enjoying beautiful music together. Libra is air and Scorpio is water.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common!\nYour social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity.\n"
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "libra",
    "text": "When Libra and Sagittarius come together for love or any kind of relationship, it’s best friends for life! These two pleasure-seeking hedonists love good food and a good time, which can also lead to overindulgence. A Libra-Sagittarius relationship is free-flowing and warmhearted, since you both understand each other’s bohemian ways. \nFriends-with-benefits…and maybe a little more? When pleasure-seeking Libra meets hedonistic Sagittarius, your mutual lust for life is sparked. You’re both foodies, bookworms, extroverts, and class clowns who love nothing more than a great belly laugh over a plate of four star pasta…quite possibly followed by a night of karaoke or dancing after that. The pounds could pack on quickly, but you’ll be too busy groping each other as you duet “Islands In The Stream,” to care about a little muffin-topping. A creative project may take the place of kids for you, but as parents, you’ll tend to take a more bohemian approach to childrearing. Trouble emerges in paradise when you start talking the “C” word: commitment. This is one matchup where Sagittarius tends to chomp at the bit for certainty rather than playing the wishy-washy role. Libra’s slow-moving pace could infuriate the impatient Archer who wants to know NOW that there’s no one else in the picture for Libra. If Sag doesn’t slow down and Libra doesn’t speed it up, you could both destroy a perfectly good thing before it gets off the ground. If you do manage to find a common speed, this will be a blissful union that stands the test of time. Libra is air and Sagittarius is fire.\nLet the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways. The key difference between your elements is that air signs tend to be more cool, detached and cerebral, while fire signs are more impulsive, emotional and expressive. In essence, air signs are more “head” while fire signs are more “heart.” When a disagreement erupts, the air sign will want to discuss it objectively, which can seem cold and uncaring to the worked-up and reactive fire sign partner, who may talk in circles or get defensive, frustrating the solution-oriented air sign. At times, the fire sign may feel exhausting—too much energy! And when the air sign gets stuck in analysis paralysis, the fire sign will lose patience. (“Just do something already!” says fire.) In nature, air can feed a fire, helping it spread—just as an air sign partner fans the flames of the fire sign’s passion. Fire heats up the chilly air, and fire signs help air signs warm up and take chances. But another fire-air scenario is blowing out a match—one gust of wind from the wrong direction and the flame goes out."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "libra",
    "text": "When Libra and Capricorn come together for love or any kind of relationship, it’s the perfect blend of power and pleasure! These two fashionistas know how to work a room together, which can lead to power couple status. A Libra-Capricorn relationship can also be superficial, since you both can struggle to drop your masks behind closed doors. As addictive as cocaine! This simmering obsession begins the moment you two fashionistas lock eyes. Capricorn brings the power and elegance; Libra supplies charm and beauty. Your combined social mojo could rattle the coolest snake charmer’s cage. Although together you could hock ice to Eskimos, you might also sell each other a false bill of goods. Looking good is important to both of you. The social masks you wear for the world don’t come off easily when the two of you get behind closed doors. As a result, this relationship can remain superficial…even after knowing each other for years. Ambitious Capricorn puts career and financial success above relationships. Libra would sell the farm in the name of love. Reaching a happy medium is challenging for the long haul. If Capricorn is willing to be the breadwinner, earning a sizable enough budget for Libra’s tastes, you could divide roles along traditional lines. Libra is air and Capricorn is earth.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words. Because of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field.\nSo, how can you strike a balance? You work together best when the air sign brings exciting ideas to the table and the earth sign builds them into a tangible reality. The air sign partner will also have to make a more dedicated effort to follow through on promises. Some measure of routine and consistency will have to be followed—even if the air sign abhors tradition. One solution for breaking up the “monotony” of, say, yet another family Christmas? Let the social air sign plan the parties, playlists, decorations, menu and other creative flourishes. And allow for some new faces to be added to the guest list. That way, the dueling needs for novelty AND consistency will both be satisfied. The earth sign will have to be more flexible and open-minded, willing to try the new ideas the air sign introduces. Earth partners will have to learn to be more spontaneous instead of always insisting on a plan. In return, the air sign must stick to SOME part of the plan, not changing the time, showing up late or inviting random tagalongs at the last minute."
  },
  {
    "firstsign": "aquarius",
    "secondsign": "libra",
    "text": "When Libra and Aquarius come together for love or any kind of relationship, it’s straight to cloud nine! These two dreamy air signs both love freedom and travel, which can lead to epic adventures together around the world. A Libra-Aquarius relationship tends to avoid conflict, which can lead to harboring resentment if you don’t voice your feelings. Cloud nine! It’s a heavenly matchup when you uber-compatible air signs decide to float through life as a couple. Libra loves nothing more than a jam-packed social calendar. Aquarius is generally found at the epicenter of a lively crew of offbeat thinkers, seekers, artists, and rockstars. Although Libra’s friends tend to be more polished and refined, your social circles dovetail beautifully. Before you know it your respective friends are Facebooking each other without your prompting, creating an automatic extended family for the two of you. Good thing, since this matchup lends itself more to legendary adventures than children. You’ll happily fall into the role of babysitters, godparents, and the quirky aunt and uncle who teenagers look up to. If you decide to marry (which may seem like an unnecessary extra step for your free bird matchup), pick out matching luggage sets for your registry or have guests contribute to a “honey fund” so you can kick off your life together with an epic travel plan. Seeing every corner of the world as a couple is a destiny worth fulfilling together. Welcome to passive-aggressive central! As easygoing air signs, you both avoid conflict like the plague, which can cause bitterness to quietly fester. When tolerance reaches its limit, Libra will lash out with a snippy, judgmental comment. Aquarius will strike back with a deadly lightning bolt, even being shockingly cruel. Force yourselves to air grievances as they happen instead of letting things build up because you both want to seem so cool and laid back. Libra and Aquarius are both air signs\nLet’s take a road trip! Ooh, yay! And then we’ll hop a standby flight or go skydiving. Yes yes yes! By the way, I just scored two Hamilton tickets—surprise! We’re going to New York!\nPut two spontaneous air signs together, and you might just get an exciting, non-stop barrage of conversation and ideas. But do any of these grand schemes actually happen? That’s the challenge in a double air-sign duo—and a noble one you might both just rise to! Your social signs both crave novelty. You’ll be the first in line to try the buzzy new restaurant, see a trending new band or get the latest iPhone upgrade. In fact, you might be the pair camped outside the Apple store, entertaining the crowds with a magic show or a mobile coffee cart.\nTrouble begins in an air-sign love match when there’s TOO much change. You may be constantly on the move and never really rooted. There can be flakiness, as you blow with the wind, or run as “hot and cold” as the air temperatures outside. You both easily get scattered, and your million friends, activities and separate interests could make it hard to find quality time. Air signs are communicative, but not always compassionate—your arguments can turn into brutal verbal dagger-flinging.\n\n"
  },
  {
    "firstsign": "pisces",
    "secondsign": "libra",
    "text": "When Libra and Pisces come together for love or any kind of relationship, you’re both instantly swept off your feet! These two hopeless romantics love flowers, chocolates and candles, which can send you both straight to cloud nine. A Libra-Pisces relationship is highly sensitive and compassionate, since you both understand each other’s empathic ways. \nYou’re both hopeless romantics waiting for the proverbial prince or princess to materialize and sweep you away. Initially, it seems that you’ve finally found that in each other. Hearts go pitter-patter as bottles of wine are uncorked, life stories exchanged with vivid (and dramatic-tragic) detail, forgotten dreams reawakened in the supportive glow of your co-created “safe space.” Your love affair has a magical storyline worthy of network television coverage. If you can stop questioning your relationship and take it one day at a time, you won’t scare each other off. Find other people to fill in the practical gaps for you. This is one relationship that needs a life coach to keep it on track! While you can build castles in the clouds with your words, you both tend to be more dreamers than doers. Your inspiring conversations may never materialize into anything tangible, which can be a buzzkill for both of you. Libra is known for being indecisive—how can you REALLY be sure you’ve found The One? Pisces tends towards flakiness—you’d rather swim away than be caught in anyone’s net. Although you may commit to each other on paper, it’s hard to ever feel 100 percent certain about each other. This thorny fairy tale that might not make it to the “final rose” ceremony. Libra is air and Pisces is water.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common! Your social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity."
  },
  {
    "firstsign": "scorpio",
    "secondsign": "scorpio",
    "text": "When Scorpio and Scorpio come together for love or any kind of relationship, it’s an instant psychic connection that moves fast. These two soul-stirring mystics crave sex and intimacy, which could become isolating since you’ll never want to leave the bedroom! A Scorpio-Scorpio relationship can move quickly, since you both understand each others’ need for lifelong perma-bonding. Your bond is more solid than Krazy Glue! There’s an unspoken safety in the arms of a fellow Scorpio. Here, you don’t have to put on a happy face, ‘fess up to your insecurities, or cover up your general scorn for the masses. You can just be your smoldering self, no explanations required, no questions asked. With your mutual ability to pick up on psychic signals, you’ll share an unspoken connection that is damn near telepathic. As such, you can pretty much skip the whole courtship song and dance, and get right down to your favorite form of communication: sex. The foreplay is mind-blowing as you study ever inch of each other with obsessive fascination. Then you’ll stay up for the rest of the night taking nude photos of each other and composing ironic-yet-soulful indie rock love ballads dedicated to each other. It’s so damn easy to be together that you’ll set up camp quickly in each other’s homes. Life together is a mystical journey that never grows boring. Warning: Go ahead and pack up your single lives—the U-Haul may be rented before you can plan the third date! Since you’re both 100 percent devoted to all that you do, children can interrupt your sexual groove, becoming the sole focus of your union. Try to strive for more balance as a couple. Although Scorpios are capable of lengthy periods of celibacy, you’ll sacrifice your fundamental life force energy if you “close up shop” for too long. While it’s nice to feel so safe together, comfort has its limits. Scorpio and Scorpio are both water signs. \nInto the depths you go! Two highly sensitive and perceptive water signs can get VERY comfortable with each other—and fast. You could go from dating to suddenly meeting each other’s parents and families and earning the seal of approval. Home is everything to the water sign. Your solitude-seeking souls need to retreat to a private and intimate hub after being out in the wider world. You could host the holidays, rent the beach house where everyone communes, have kids crawling out of every nook. A water sign home is likely to feature cozily-appointed guest bedrooms and lots of spare pillows and blankets. Your nostalgic signs both cherish family and tradition. Since you don’t trust easily, you may have a small, tight-knit circle of friends that you keep for life. If you open a business together, you’ll create a “family” vibe at the office. (And yes, they’ll be secretly subject to loyalty tests)\nWhile it’s nice to feel so safe together, comfort has its limits. If you wrap yourselves too tightly in this security blanket, it can smother you. A water sign relationship can devolve into a parent-child dynamic (complete with baby talk and cloyingly cutesy nicknames) and self-destructive indulgence in food, drink and self-soothing activities like shopping. You can get TOO deep “in your feelings,” stirring up a tsunami of emotions that can spiral into rage and even abuse if you aren’t careful. Your powerful moods may overlap or spiral out of control if not managed. Although water can be placid and beautiful, it can actually do great damage. To avoid creating a hurricane, you’ll both need to talk to a therapist or a grounded friend before unleashing your anger, resentment or jealousy on each other. Water that doesn’t move can become stagnant and toxic—and a water-sign couple may become possessive and fearful of change to their own detriment.\n"
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "scorpio",
    "text": "When Scorpio and Sagittarius come together for love or any kind of relationship, it’s an intense love/hate affair with plenty of cosmic chemistry! These two spiritual warriors can easily butt heads, but can also complement each other when you play to your strengths. A Scorpio-Sagittarius relationship is never boring, since you both understand each others’ need for truth and passion. Run for cover! The Scorpio and Sagittarius relationship is a love/hate affair that’s never short on passion. Since pleasures of the flesh DO rank high on “must-haves” for both signs, it’s worth it to see if true love exists beyond the very obvious physical chemistry. Common ground is limited but it’s there. Both signs are ambitious, hardworking, creative, and have a strange love of karaoke. Instead of trying to hit the same note, find a duet that harmonizes your disparate talents. Let Scorpio control the purse strings and ensure that quality control standards are rigorously met. Give Sagittarius the horn to toot your big ideas to the world. Your connection may literally begin with a battle. The Archer slings arrows of truth, exposing Scorpio’s soft underbelly. In defense, the Scorpion returns with a poisonous sting that knocks cocky Sagittarius off the high horse. Ouch! The next thing you know, you’re ripping each other’s clothes off and screwing like Michael Douglas and Glenn Close in “Fatal Attraction”…but it might just be the best sex either of you has ever had. You could soon be living the lifestyles of the rich and famous, even if you eventually do so from separate residences. Having your own living quarters (or wings of the house) can be the saving grace for your long-term arrangement, as your intense matchup will send you both scurrying for space from time to time. \nScorpio is water and Sagittarius is fire.\nToo close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation. \nSo, how can the traditionalist water sign and the risk-taking fire sign happily coexist? The fire sign will have to enter the water sign’s world of family visits, downtime at home, returning to the same vacation spots and hanging with a small crew of lifelong friends…even if that feels limiting or stagnant. In return, the water sign will have to embrace adventure, travel, meeting new people (and being social when they do!), risk and changing up their comfortable routines from time to time. Parents can be a big sticking point, as the water sign partner is often dutifully close to theirs while the fire sign may have left home at 18 and never looked back. In nature, water can put out a fire, which can either control a raging wildfire (good) or douse a vibrant flame (not so good). Fire can warm up cold water, but it can also make it boiling and steaming mad! Too much fire can even cause water to evaporate, just as an overly dominant fire sign can cause the less aggressive water sign to “disappear” in the relationship."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "scorpio",
    "text": "When Scorpio and Capricorn come together for love or any kind of relationship, it’s a complementary match you won’t want to miss out on! But since these two over-achievers both shoot for the moon, your busy schedules may not leave you enough time left over for each other. A Scorpio-Capricorn relationship is inspiring and secure, since you both understand each others’ need for tireless ambition. Obsessive and compulsive, but not necessarily disordered. Scorpio and Capricorn are high flying super-achievers who won’t rest until you’ve staked your claim to fame.  The whole “have your secretary call my secretary” schtick is fine for work appointments, but don’t play that card when setting up a date. This is not a match you’ll want to miss out on. Make the extra time for one another, even if that means scheduling a weekly, non-negotiable Date Night. Whether the goal is career, family, or something else, you both devote yourselves wholeheartedly to all that you do—and your relationship is no exception to the rule. Unfortunately, your busy schedules may clash, making it tough to get your love affair off the ground. Direct communication is not a forte here and neither of you likes to drop your guard. Scorpio can be mysterious and manipulative; Capricorn cold and calculating. Fortunately, Capricorn will usually provide a stable enough base for Scorpio to feel safe opening up and showing some emotion. Once you’ve dropped your guards, this will be a rock-solid union capable of producing adorable trust fund babies to shower with the best of the best—just the way you both like it. Scorpio is water and Capricorn is earth.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too. There are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable!"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "scorpio",
    "text": "When Scorpio and Aquarius come together for love or any kind of relationship, it’s as though the missing link has been discovered! But these two polar opposites don’t necessarily make the most sense at a first glance. You can strike a balance if you cultivate trust and open yourselves up to each other’s very different ways. A Scorpio-Aquarius relationship is never boring, since you both understand each others’ need for soul-stirring connections. A strange brew that bubbles with chemistry. Intense, emotional Scorpio and cool, logical Aquarius  don’t make much sense on paper. In real time, however, you have a natural affinity that warms both your souls. As a couple, you provide a missing link for one another. Family-oriented Scorpio shows Aquarius that “settling down” can be an act of endless creativity. (Look what happened when Aquarius Ashton Kutcher met Scorpio Demi Moore!) Gregarious Aquarius helps Scorpio drop the defensive shield and become more open to the “strangers” of the world. You’re both control freaks in your own way, which is fine provided you don’t turn that energy onto each other. If Scorpio tries to restrict Aquarius’ socializing or gets jealous of Aquarius’ 834 Facebook friends, your relationship status could quickly go from “It’s Complicated,” to “It’s Over.” For Aquarius, friends aren’t just friends—they are an extended family. Cutting off from them is a no go. Conversely, Scorpio’s seductive conversational style can provoke jealousy in Aquarius. The Water Bearer should not fling accusations of cheating without proof (there probably is none, even if Scorpio DID drift). Questioning Scorpio’s loyalty is the ultimate offense and can break your bond for good. In light of your drastically different social styles, make an extra effort to communicate about fears before they blaze out of control. This relationship does require a lot of reassurances to keep insecurities at bay, but it’s certainly never going to be boring. Scorpio is water and Aquarius is air.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common! Your social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity."
  },
  {
    "firstsign": "pisces",
    "secondsign": "scorpio",
    "text": "When Scorpio and Pisces come together for love or any kind of relationship, it’s mystical, creative and exhilarating! But these two secretive signs may also live double lives, which will require a raw honesty and vulnerability if this relationship is to thrive. A Scorpio-Pisces relationship is magnetic, since you both understand each others’ need for intimate, soul-stirring connections. Drama! Intrigue! Espionage! Marriage? Your attraction becomes an addiction quickly, although not necessarily an unhealthy one. The twelve-steppers have a saying that applies well to your union: you’re only as sick as your secrets. Although you may live together for years, it’s shockingly easy for you both to bury your heads in the sand…or worse yet, hide double lives from each other. Instead of opening up about your fears or insecurities, you can easily escape into your shared interests—and these will be plentiful. You are both capable of becoming powerful healers, mystics, and creative geniuses, but the success of your union requires a naked honesty that you’ll each find exhilarating and terrifying. On the other side of that rainbow is a pot of gold: You’re capable of creating a gorgeous home together, filled with pets and even a genius kid or two.\nBoth Pisces and Scorpio have a sneaky streak which may intensify when you fall for one another. Should you form any sort of a “don’t ask, don’t tell” pact, your relationship is basically doomed. Confess your so-called sins quickly and your relationship can reach the depths of intimacy while elevating you both into an inspiring state of high consciousness. Scorpio and Pisces are both water signs.\nInto the depths you go! Two highly sensitive and perceptive water signs can get VERY comfortable with each other—and fast. You could go from dating to renting a U-Haul in short order, especially if you meet each other’s parents and families and earn the seal of approval. Home is everything to the water sign. Your solitude-seeking souls need to retreat to a private and intimate hub after being out in the wider world. You could host the holidays, rent the beach house where everyone communes, have kids crawling out of every nook. A water sign home is likely to feature cozily-appointed guest bedrooms and lots of spare pillows and blankets. Your nostalgic signs both cherish family and tradition. Since you don’t trust easily, you may have a small, tight-knit circle of friends that you keep for life. If you open a business together, you’ll create a “family” vibe at the office. (And yes, they’ll be secretly subject to loyalty tests.) While it’s nice to feel so safe together, comfort has its limits. If you wrap yourselves too tightly in this security blanket, it can smother you. A water sign relationship can devolve into a parent-child dynamic (complete with baby talk and cloyingly cutesy nicknames) and self-destructive indulgence in food, drink and self-soothing activities like shopping. You can get TOO deep “in your feelings,” stirring up a tsunami of emotions that can spiral into rage and even abuse if you aren’t careful. Your powerful moods may overlap or spiral out of control if not managed. Although water can be placid and beautiful, it can actually do great damage. To avoid creating a hurricane, you’ll both need to talk to a therapist or a grounded friend before unleashing your anger, resentment or jealousy on each other. Water that doesn’t move can become stagnant and toxic—and a water-sign couple may become possessive and fearful of change to their own detriment.\n"
  },
  {
    "firstsign": "sagittarius",
    "secondsign": "sagittarius",
    "text": "When Sagittarius and Sagittarius come together for love or any kind of relationship, it’s exciting and adventurous! These two globetrotters crave freedom and expansion, which can make it difficult to settle down. A Sagittarius-Sagittarius relationship is wild and young at heart, since you both understand each others’ unending desire for exploration and evolution. Better off as friends, but a fun ride while it lasts. As Sagittarians, you are both world travelers and entrepreneurial risk-takers who inspire each other view life’s glass as overflowing with opportunity. As perpetual students and spiritual seekers, your relationship may revolve around exploring, expanding, and experimenting. Conventions be damned! Neither one of you likes to be fenced in or limited in any way. You’re so open-minded that an “open relationship” often becomes an option you at least discuss. A risky proposition, as this may lead you to people with whom you have a more electrifying sexual chemistry. Amicable and good-natured, if you do break up, you’ll likely to remain lifelong friends. Still, there’s no replacing your emotional bond. You’ll feel like long lost family members from day one.\nBut the soulmate mojo can cool down to a platonic sibling vibe if you don’t create at least a few traditions and routines to anchor your relationship into SOME semblance of a structure. Caution: you may feel tempted to have children as a means of solidifying your bond, but your nomadic souls will resent the kids if you’re not ready to be “pinned down” in one place at the time. You’ll definitely parent in an alternative manner–your kids will have more stamps in their passport books by age 5 than the average U.S. citizen amasses in a lifetime. \nSagittarius and Sagittarius are both fire signs.\nThe heat is on! Your Sun signs are both in the element of fire. This exothermic combination can move from zero to soulmate in mere seconds, as you recognize a kindred spirit in this compatible astrology love match. But as quickly as your lusty wildfire blazes up, it can also sweep out of control…or go from sizzle to fizzle. Your tempers can be as scorching as your sex, so while you might set off an inferno in the sheets, your arguments can also be legendary. Remember: Civilization began when man learned to make, tend and control fire. It cooks our meals, keeps us warm, powers everything. But by nature, fire does not WANT to be controlled, and neither do fire signs. This relationship must leave room for individuality, exploration and autonomy within safe boundaries. Making and keeping a commitment has to be handled delicately, so as not to lose the spark or smother the flame. \nIn astrology, the “qualities” or “triplicities” reveal the role you play in a relationship or collaboration. Are you a starter, a doer or a finisher? Do you like to take charge and have a plan, or do you prefer to go with the flow? In the case of two mutable signs, it’s non-stop variety and spontaneity. This can make life a grand adventure—one week you’re in Bali, the next you’re in Berlin—but you can also get totally un-grounded as a duo. Who’s gonna create the structure in this relationship? (answer: no one.) Making a decision (or even committing!) can also be difficult, since neither of you likes to be locked into anything permanent. This is the couple that’s together for decades, but never “gets around” to marrying. The idea of freedom actually serves as a binding agent between the two of you."
  },
  {
    "firstsign": "capricorn",
    "secondsign": "sagittarius",
    "text": "When Sagittarius and Capricorn come together for love or any kind of relationship, it’s going to be a challenge—but at least you’re both up for it! These two entrepreneurs are also total opposites, which can create a push-pull dynamic when trying to get just about anything done. A Sagittarius-Capricorn relationship is worth exploring, since you both understand each others’ ambitious natures and lavish tastes. Reaching the honeymoon phase is going to be tricky here! This combination works best when both signs have amassed an individual fortune and can spend lavishly on travel, designer clothes, and a business venture that makes no sense on paper but has the power to revolutionize the world. While there’s plenty of sizzle and steam in the beginning, it’s hard for you to coexist in the same atmosphere. Both signs love a challenge and this relationship will certainly bring that. You share an entrepreneurial nature, but Sagittarius is a gambler while Capricorn only takes extremely calculated risks. “More, more, more” is the Sagittarius mantra, which scares cautious Cap to no end…especially when it comes to the Archer’s impulse spending. As a result, Capricorn may earn a country club membership, while Sagittarius remains locked outside of the elite golden gates.  \nProceed with caution. Your relationship is literally fire (Sagittarius) and ice (Capricorn). Aggressive, adventurous Sagittarius quickly hits a wall with cautious, rule-abiding Capricorn. As Cap lays down the laws (and refuses to bend them). Sagittarius charges forward, smashing your overzealous head against Capricorn’s stony barricade. As parents, you’re a slightly awkward couple since you can’t agree on anything beyond the merit of feeding the family organic food. Capricorn will want to spend holidays with a large group of relatives while Sagittarius would rather drop the kids off with grandparents and escape for a romantic trip to St. Thomas. \nSagittarius is fire and Capricorn is earth.\nHandle with care! This astrology love match of wildly different elements can thrive as long as you play to your strengths. Grounded earth signs seek stability and want to put down roots. By contrast, adventurous fire signs long to explore, grow and spread into new terrain. A battle can erupt as one of you strives for freedom while the other craves consistency. The fire sign will feel caged in by the white picket fence fantasy, while the earth sign can never relax with constant change and surprises. But if you learn to appreciate your differences, then you can offer what the other one is missing. The worldly fire sign will have a predictable home base to return to, lovingly tended to by the earth sign partner. In exchange, the earth sign will avoid getting stuck in a stagnant rut because the fire sign will encourage growth and adaptation. There are four elements in astrology: fire, earth, air and water. Each one plays an important role in the greater whole of humankind. A love match with someone from of a different astrological element can be challenging, but also a beautiful opportunity to evolve. After all, differences push you both to grow and step outside of your own experience. Earth signs are sensual and practical, and impulsive fire signs can benefit from their grounded approach. In this relationship, the fire sign can learn to slow down and savor the moment, rather than rushing off to the next big thing. And the fire sign can help the earth sign take more chances in life. Think in terms of nature: dirt can smother a fire, and fire can scorch the earth. But in order to build a fire and maximize its creative powers, there must be a steady ground beneath the flames."
  },
  {
    "firstsign": "aquarius",
    "secondsign": "sagittarius",
    "text": "When Sagittarius and Aquarius come together for love or any kind of relationship, it’s going to be a fun and wild ride! These two party-people have a BFF dynamic, which can lead to awkwardness in the bedroom since your connection can be platonic. A Sagittarius-Aquarius relationship is liberating and expansive, since you both understand each others’ need for freedom and a higher purpose. A bohemian rhapsody that may only last for a few seasons. You’re gregarious, inventive party people who are also guided by a higher purpose. Sagittarius is the philosopher, Aquarius the humanitarian, and you both prize freedom more than life itself. This makes it inexplicably easy to be around each other…and ease is what you both want from life. Like a modern-day version of 1960s beatniks, you’ll tour the country in a tricked out Airstream trailer (upgraded to run on vegetable fuel), adding friend after friend to your Facebook pages from every town you stop in. You’re insta-BFFs, and the sidesplitting humor stirred up by you two jokesters is worthy of a Comedy Central special. Although there’s a strong idealistic chemistry that flows between you, translating that to the physical realm can be somewhat awkward. Kissing cousins ARE legal in some states, but is that honestly a sexy proposition? Think carefully before you go there. Adding benefits to this friendship can destroy the connection in many cases. Talk through your long-range fantasies first. Although impatient Sag pushes for a commitment, Aquarius tends to want more structure from a life partnership. Plus, neither one of you wants to sacrifice your dreams—a shared goal is essential if this is to work over time. Should you decide to raise goats on an organic farm, or start a motivational speaking company together, go ahead and hop into the sack, because bliss is yours for the taking! Sagittarius is fire and Aquarius is air.\nLet the good times roll! Fire and air signs have a lot of similarities—both are adventurous, expressive and full of grand schemes and plans. In this astrology love match there should be no shortage of fun dates and plans. You’re both game to try anything once! Beyond being lovers, you are also simpatico friends who “get” each other in many ways. In fact, this relationship may develop organically from a platonic bond that develops first. In some cases, it may cool down to a more buddy or sibling vibe after the honeymoon period ends, as both fire and air signs are excited by novelty and grow bored when things become too familiar. This may not be the most sensual match in the bedroom, but the lively conversations, hilarious jokes and spontaneous adventures you share can keep you satisfied in other ways."
  },
  {
    "firstsign": "pisces",
    "secondsign": "sagittarius",
    "text": "When Sagittarius and Pisces come together for love or any kind of relationship, it’s fantasy-fueled with dream-come-true potential! These two indecisive signs can struggle to commit, but also have a tendency to depend too heavily on each other which can lead to frustration. A Sagittarius-Pisces relationship is creative, cerebral and romantic, since you both understand each other’s philosophical and high-minded ways. Slip on the rose-colored glasses. When the idealistic Archer meets the dreamy Fish, you quickly replace reality with fantasy. Midnight bike rides, costume parties, spontaneous road trips…you’re both ready for an adventure at a moment’s notice. This is a “tune in, turn on, drop out” kinda combo, which is fine if you’re independently wealthy or enjoying a vacation fling together. In the real world, the two of you may struggle to stay afloat or ever build a solid foundation to house your blazing attraction. If one of you is willing to plant a foot on solid ground, this can be a dream-come-true romance for both of you. Creative Pisces becomes an inspiring muse for Sagittarius, teaching the Archer to slow down and develop ideas with deeper meaning. Entrepreneurial Sag encourages Pisces to put a price tag on your talented offerings instead of playing the sacrificial martyr role at work. Getting to “I do” can be an exercise in frustration as you both swing between co-dependence and commitment-phobia like a high-speed pendulum. It’s likely you’ll just elope to Vegas one day or find yourselves in a common law marriage after ten years of cohabitation and the kids you had “accidentally” while you were getting it on in the DJ booth at a club in Buenos Aires, Barcelona, or Bali. Sagittarius is fire and Pisces is water.\nToo close for comfort? As an astrology love match, fire and water signs can have wildly different needs. To succeed as a couple, compromise is essential. Water signs are soothing and nurturing, prone to fluctuating moods. They deeply crave security and comfort. By contrast, Fire signs can be aggressive, independent and often seek discomfort in the name of adventure. While water signs are nostalgic and tend to live in the rosy-hued (or overly maligned) past, fire signs are pioneers who get most excited about sculpting a future of their own creation. In astrology, the “qualities” or “triplicities” reveal the role you play in a relationship or collaboration. Are you a starter, a doer or a finisher? Do you like to take charge and have a plan, or do you prefer to go with the flow? In the case of two mutable signs, it’s non-stop variety and spontaneity. This can make life a grand adventure—one week you’re in Bali, the next you’re in Berlin—but you can also get totally un-grounded as a duo. Who’s gonna create the structure in this relationship? (Zero hands raised.) Making a decision (or even committing!) can also be difficult, since neither of you likes to be locked into anything permanent. This is the couple that’s together for decades, but never “gets around” to marrying. The idea of freedom actually serves as a binding agent between the two of you.\n\n\n"
  },
  {
    "firstsign": "capricorn",
    "secondsign": "capricorn",
    "text": "When Capricorn and Capricorn come together for love or any kind of relationship, it’s instant power couple status! These two hard-working go-getters crave stability and security, which can lead to boredom in the bedroom. A Capricorn-Capricorn relationship is successful financially and emotionally, since you both understand each other’s ambitious nature. A picture-perfect matchup! Your Capricorn-Capricorn relationship could be torn from the pages of a society magazine, and you’ll quickly become the Alpha Couple of your social circle. You’re both ambitious, practical, family-oriented and hardworking. From six-figure salaries to gifted children to athletic trophies to private planes to humanitarian awards, impressive accomplishments rack up one by one when you join forces. As stunning as this relationship looks on paper, it can be a little lackluster in the sex department. You’re both “horny Goats” with hidden wild streaks, and the cozy stability you provide one another may not be quite taboo enough to keep you interested over time. Some role-playing and costume changes may need to be implemented. Ms. Capricorn, how about dressing up in a trench coat, high heels and sunglasses (and nothing else) and paying a surprise visit to Mr. Cap’s private office for a mid-day romp? Fetish-wear, piercings, and other edgy accoutrements should find their way under your buttoned up exteriors if you want to keep the sparks alive after the five o’ clock whistle blows. Capricorn and Capricorn are both earth signs.\nHome sweet home…or humdrum? As two grounded earth signs, you are both seeking security, consistency and a bond that’s built to last. Tradition and integrity are important—in each other, you find the stability you crave. Soon enough, you’ll ease into pleasant routines and rituals together. Structure and routine come naturally to earth signs. Whether you’re running a business or a family together, your ability to “keep it simple” is one of your shared earthy superpowers. This rock-solid combo can create a lovely legacy that stands the test of time. The challenge? Getting stuck in a rut. Your life can become stagnant if you don’t refresh your worldview periodically by traveling, learning new philosophies or inviting fresh faces into your circle. Together, you may become too iron-fisted and conservative, which others will find intimidating. Because the earth element rules the physical world, you can also become overly materialistic and status-driven. Or you may indulge your senses by eating, drinking and accumulating possessions, forgetting to work on spiritual and emotional development. Too much of the tried-and-true can also prevent you from evolving with the times. Earth-sign pairings must view change and risk as an opportunity rather than a threat. Compromise is also a skill that needs extra work here. Earth signs stand their ground, but they can also stubbornly dig in their heels. If you turn that intractable nature on each other, it can be an endless war—with nobody willing to budge! \nIn astrology, every sign has a “polarity”: you’re either yin (feminine) or yang (masculine). You are  both yin signs: receptive, sensitive and intuitive. When all is good, you are deeply simpatico, nurturing one another and sharing romantic, thoughtful gestures. The downside? Your fluctuating moods may collide, causing dramatic fights that can escalate into an unnecessary cold war. You can also get SO tuned into each other0’s emotions that your bond turns codependent. While it’s lovely to build a cozy cocoon, make sure you don’t get stuck in that bubble and stunt each other’s personal growth.\n"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "capricorn",
    "text": "When Capricorn and Aquarius come together for love or any kind of relationship, you’re in it to win it! These two status-seeking go-getters love a good challenge, which can put a damper on spontaneity. A Capricorn-Aquarius relationship can truly have it all, since you both truly understand each other’s tireless ambition. Marriage material. You both thrill at the prospect of a challenge and will work tirelessly to achieve a goal. This is a relationship built for having it all, and dreams become a reality quickly when you join forces. Neither of you is a quitter, so when you commit to each other, you’re in it to win it. Capricorn brings out the practical planner in Aquarius, while Aquarius teaches Cap how to juggle multiple ambitions. With all that go-getter energy, you may splash cold water on each other’s spontaneous nature. Two project managers sharing one bed can turn disastrous if you don’t manage your overarching ambitions. When you inevitably start mapping out your relationship on an Excel spreadsheet…red flags! Red flags! How about scheduling in some fun for a change? Those vacations you used to love? Pause to assess the big picture before you commit to a lifetime of massive projects. Do you really need to renovate the house, home birth children, start a global charity, and take your parents to an Italian Villa in the same six-month period? Although you CAN do it all, loosen up the timelines you place on each other or you could burn out before your romance has a chance to heat up. Capricorn is earth and Aquarius is air.\nAstrological odd couple? Your signs move at two wildly different operating speeds—which can create weird timing issues or make you a powerful duo if you play to your strengths. Grounded earth signs like stability and tend to want things to stay the same. By contrast, air is always on the move—the “winds of change” are always blowing for these variety-seeking signs. Another big difference? Communicative air signs are talkers, but may not always follow through. Earth signs are doers who prefer to let their actions speak louder than their words. \nBecause of the earth sign’s rooted nature, the air sign may find them to be unadventurous or “boring,” stuck in a stagnant routine. The air partner may not get the spontaneity and surprises that keep them interested. The earth partner may see the air sign partner as flaky and full of “hot air,” all talk and no action. Or, the dizzying changes can leave the earth sign feeling destabilized and anxious, unable to plan ahead without feeling sabotaged from left field.\n"
  },
  {
    "firstsign": "pisces",
    "secondsign": "capricorn",
    "text": "When Capricorn and Pisces come together for love or any kind of relationship, it’s harmonious and balancing. These two polar opposites seem to complement each other perfectly, which can lead to a codependent dynamic. A Capricorn-Pisces relationship can thrive if you give each other enough space to truly be themselves with plenty of built-to-last and even marriage potential. Can’t live with you, can’t live without you. Hardworking Capricorn meets escape-artist Pisces and BAM! You see the missing link in your lives and rainbows and sunshine burst through the gloomy clouds of pessimism you’re both prone to stewing in. Suddenly Capricorn is wearing an ascot to work instead of a tie, and quoting the poet Rumi during client meetings. Pisces can kiss those financial woes goodbye, as the high-earning Capricorn can’t help but play Sugar Mama or Sugar Daddy to the object of your affections. This relationship may have to break up and come back together again a few times before it finally settles into an easygoing groove. Give each other space and trust that if it’s meant to be it will be. If this does evolve into marriage, you’ll set up a pleasant, easygoing life together that’s as poetic as it is practical. Being “kept” can be uncomfortable for the Fish, however, as you’re much more used to playing the sacrificial martyr role. Plus Pisces HATES to be controlled…and Capricorn is all about having the control. Once you’ve connected, this is a hard habit to break. There’s a codependent energy that flows between you. It literally feels as if you need each other for oxygen sometimes. Capricorn is earth and Pisces is water.\nFor the most part this is a harmonious blend of two compatible energies. Both earth and water signs seek comfort, security and consistency. The two of you provide that nicely for each other. This is the kind of relationship that can even begin in primary school or college, then last throughout adulthood. You easily slip into a comfortable groove, especially once you live together. Your home can be a cozy, welcoming space—the hub for gathering family and longtime friends. Parenthood can be an area where you shine together, too. \nThere are differences, of course. The nature of water is emotional, while earth tends to be more grounded and practical. While a water sign might start a sentence with “I feel” an earth sign is probably more responsive to a statement that begins with “I think.” Feelings, to the earth sign, seem random and hard to follow—if there’s a problem in the relationship, the linear earth partner wants you to get to the point so they can figure out how to fix it. Unfortunately, the intuitive water sign doesn’t work that way. They need to process things in a more circular pattern, starting with their emotions and intuition—which, for water, is the most trustworthy guide. The earth sign must learn to respect the water sign’s “gut feelings,” even when they seem to defy sensibility and logic. By contrast, the water sign might want to unpack some of those emotions with a therapist or compassionate friend, rather than with the earth sign partner. Once the water sign gets to the root of what’s bothering them, THEN they can present it in a less emotionally-charged way to the earth sign. The result? The water sign will find a partner eager to problem-solve, rather than a defensive or dismissive person who patronizes them when they’re at their most vulnerable!\n"
  },
  {
    "firstsign": "aquarius",
    "secondsign": "aquarius",
    "text": "When Aquarius and Aquarius come together for love or any kind of relationship, it’s best friends for life! These two mad scientists crave freedom and adventure, which can make it difficult to settle down. An Aquarius-Aquarius relationship is incredibly stimulating, since you both understand each others’ quirky and rebellious ways. BFFs with benefits, but rarely more. If you two wanderers manage to bond romantically before heading off on your respective pilgrimages, you’ll make a fine dynamic duo. Popular, eccentric, and loved by many, your combined social circles could overtake a small village. Aquarius is the sign of the humanitarian, and you’ll need a common cause to glue you together. Emotions are foreign terrain for the cool-headed Water Bearer. Conversations about kids often lead to discussions about overpopulation and the human ego’s need to see its image reflected in a child. Oh, boy. Less talking, more doing…otherwise you could philosophize yourselves right out of your love affair. Marrying your best friend isn’t such a bad idea, is it? Discuss, consider, decide! Trying to get a reaction from each other may be like drawing blood from a stone. Inevitably, feelings will rise up in one of you…and that’s when things can get messy. As one Water Bearer sheds tears or rages with anger, the other shuts down. As you try to sort out what happens, chaos ensues, creating a complex dynamic that could send Dr. Phil to the psych ward. This match-up is often more successful later in life, once you’ve both read a library of self-help books, journeyed with Shamans, and taken enough family constellation workshops to understand the scientific pattern to your emotions. Aquarius and Aquarius are both air signs.\nLet’s take a road trip! Ooh, yay! And then we’ll hop a standby flight or go skydiving. Yes yes yes! By the way, I just scored two Hamilton tickets—surprise! We’re going to New York!\nPut two spontaneous air signs together, and you might just get an exciting, non-stop barrage of conversation and ideas. But do any of these grand schemes actually happen? That’s the challenge in a double air-sign duo—and a noble one you might both just rise to! Your social signs both crave novelty. You’ll be the first in line to try the buzzy new restaurant, see a trending new band or get the latest iPhone upgrade. In fact, you might be the pair camped outside the Apple store, entertaining the crowds with a magic show or a mobile coffee cart.\nTrouble begins in an air-sign love match when there’s TOO much change. You may be constantly on the move and never really rooted. There can be flakiness, as you blow with the wind, or run as “hot and cold” as the air temperatures outside. You both easily get scattered, and your million friends, activities and separate interests could make it hard to find quality time. Air signs are communicative, but not always compassionate—your arguments can turn into brutal verbal dagger-flinging."
  },
  {
    "firstsign": "pisces",
    "secondsign": "aquarius",
    "text": "When Aquarius and Pisces come together for love or any kind of relationship, it’s intellectual but also other-worldly! These two brainiacs crave cerebral connection, which can make it difficult to come back down to Earth. An Aquarius-Pisces relationship is deeply stimulating, since you both understand each others’ quirky ways. Weird science! There’s an unusually high level of chemistry between Pisces and Aquarius, although you have vastly different approaches to life. You’re both seduced by mysteries and enigmas, and exploring the hidden dimensions of life is a common passion. Aquarius will try to solve the riddle using logic and quantum physics. Pisces will meditate and channel a 30,000 year-old deity to draw answers from the otherworldly dimension. You’re both attracted to quirky people and you recognize a fellow eccentric in one another. Nomadic Aquarius feels a strange pull to settle down with Pisces who may be a slippery fish to grab. That makes Pisces all the more alluring, as Aquarius is bored by an easy victory. If Pisces surrenders to Aquarius’ bait and hook, you’ll have found a spiritual soulmate in one another. Both signs are drawn to healing and tend to play the role of cheerleader or supportive listener for your large circles of friends. Make sure you don’t give too much of your nurturing energy away to other people…save some of that mojo for each other. Children are optional in this combo, but you certainly won’t parent according to any rule books. Art classes, kids yoga, Suzuki violin lessons…you’ll want your children to be original thinkers and creative geniuses. Your home will be a crash pad for traveling visitors, poets, mystics, revolutionaries, and the like, but make sure you create a safe space for your kids who may hunger for more structure from the two of you. (In other words, “Why can’t you be normal Mom and Dad?”) Aquarius is air and Pisces is water.\nHead and heart combine—or collide—when you pair a talkative air sign with a touchy-feely water sign. The temperaments of these two elements are wildly different. Air signs love change, variety and novelty while sentimental water signs seek security, comfort and nostalgia. One of you is all about the new, while the other cherishes the old. You’ll have to learn to appreciate this major difference. Otherwise, you could quickly feel like you have nothing in common!\nYour social habits may need some tweaking to make this work. Water signs don’t trust easily, and tend to roll with a tight-knit clique—many of whom they’ve known since childhood. By contrast, air signs never met a stranger and are constantly introducing you to their latest BFFs. The water sign might be jealous or threatened by all of these newcomers, while the air sign feels suffocated and bored by seeing the same old faces. Compromise is key. The water sign partner will have to be more open to new people and experiences, going with the flow. The air sign will have to embrace tradition and develop more emotional sensitivity. The benefits of this match is an opportunity for growth. Since water signs can be TOO “in their feelings,” the cooler, rational air sign partner can teach them the power of detaching. The water sign will learn how to take things less personally, laugh at themselves and lighten up. In exchange, the water sign can teach the glib air sign to dive into their depths more, rather than being overly superficial or turning everything into a joke. The water sign may create a cozy, beautiful home, while the air sign fills it with interesting guests, music and art. Both of these elements can be “culture vultures,” and may bond of dissecting a documentary film, singing karaoke (you both could have encyclopedic knowledge of lyrics) or even traveling."
  },
  {
    "firstsign": "pisces",
    "secondsign": "pisces",
    "text": "When Pisces and Pisces come together for love or any kind of relationship, it’s creative but also highly emotional! These two sensitive souls crave romance and indulgences, which can often lead to a codependent dynamic. A Pisces-Pisces relationship is deeply healing, since you both understand each others’ need for conscious connection. Poetic and passionate, the depths of intimacy can be reached in a Pisces and Pisces relationship. Some days, you’ll plunge to the bottom of the emotion ocean, others’ you’ll float on a gentle current. With your shared creative genius, you’ll have found an ever-inspiring muse in one another, and your home could quickly turn into an artist’s studio space. The unspoken connection you two psychic soulmates share can be deeply healing or deeply destructive. If you’re both drowning in sorrow (which happens often for your sensitive sign) who’s gonna throw you a life raft? Commitment is a slippery subject as neither one of you likes to be caught in another person’s net. Since Pisces can be prone to addiction—it’s easy to lose sight of limits when it comes to indulging in rich food, popping open bottles of red wine, and spending on whatever seems impulsive and romantic in the moment. Save some money for hiring help. You’ll need outside sources to provide structure—accountants, housekeepers, nannies, life coaches. Indeed it may take a village to keep your relationship thriving. Good thing Fish like to swim in schools! Pisces and Pisces are both water signs.\nInto the depths you go! Pisces and Pisces are two highly sensitive and perceptive water signs can get VERY comfortable with each other—and fast. You could go from dating to renting a U-Haul in short order, especially if you meet each others’ parents and families and earn the seal of approval. Home is everything to the water sign. Your solitude-seeking souls need to retreat to a private and intimate hub after being out in the wider world. You could host the holidays, rent the beach house where everyone communes, have kids crawling out of every nook. A water sign home is likely to feature cozily-appointed guest bedrooms and lots of spare pillows and blankets. Your nostalgic signs both cherish family and tradition. Since you don’t trust easily, you may have a small, tight-knit circle of friends that you keep for life. If you open a business together, you’ll create a “family” vibe at the office. (And yes, they’ll be secretly subject to loyalty tests) While it’s nice to feel so safe together, comfort has its limits. If you wrap yourselves too tightly in this security blanket, it can smother you. A water sign relationship can devolve into a parent-child dynamic (complete with baby talk and cloyingly cutesy nicknames) and self-destructive indulgence in food, drink and self-soothing activities like shopping. You can get TOO deep “in your feelings,” stirring up a tsunami of emotions that can spiral into rage and even abuse if you aren’t careful. Your powerful moods may overlap or spiral out of control if not managed. Although water can be placid and beautiful, it can actually do great damage. To avoid creating a hurricane, you’ll both need to talk to a therapist or a grounded friend before unleashing your anger, resentment or jealousy on each other. Water that doesn’t move can become stagnant and toxic—and a water-sign couple may become possessive and fearful of change to their own detriment.\n"
  }
]
